class Card {
    constructor(id, link, title, img, location, text) {
        this.id = id;
        this.link = link;
        this.title = title;
        this.img = img;
        this.location = location;
        this.text = text;
    }
}

class Detail {
    constructor(id, title, address, information, place, image1, image2, image3){
        this.id = id;
        this.title = title;
        this.address = address;
        this.information = information;
        this.place = place;
        this.image1 = image1;
        this.image2 = image2;
        this.image3 = image3;

    }
}

const app = new Vue({
    el: '#app',
    data: {
        search: '',
        select: 0,
        informationlist: [
            new Detail(
                1,//ภ่าคใต้
                "แหล่งโบราณคดีถํ้าเสือ",//Title
                "บ้านถํ้าเสือ ตำบลกระบี่น้อย อำเภอเมือง จังหวัดกระบี่",//Address
                "สมัยที่บริเวณนี้ยังเป็นป่ารก ชาวบ้านได้พบเห็นเสือโคร่งเดินเข้าออกแถบถํ้านี้อยู่เสมอจึงเรียกกันว่า ถํ้าเสือ และเป็นชื่อหมู่บ้านนี้ด้วย เมื่อพระอาจารย์ จำเนียร สีลเสฏโฐ มาบุกเบิกใหม่ๆ \
                ได้เล่าว่า สภาพเดิมเป็นป่ารกมาก มีถํ้าที่สงบเงียบเหมาะแก่การทำวิปัสนากรรมฐาน ได้พบคนแปลกหน้าคนหนึ่งในหุบเขาคีรีวง ท่านได้ถามว่าในถํ้านี้เป็นอย่างไรบ้าง \
                ชายผู้นั้นตอบว่าขอให้ท่านขึ้นไปขี่บนหลังของเขาเถอะแล้วจะพาเข้าไปดูในถํ้าและบอกว่ามีทรัพย์สมบัติมากมาย แต่ท่านก็มิได้ไปเพราะคิดว่าคนผู้นี้จะอาศัยท่านเข้าไปเอาวัตถุมีค่าในถํ้าเสียมากกว่า \
                ต่อมาเมื่อท่านนำพระและเณรมาอยู่แล้วก็พบชายผู้นี้อีกครั้งหนึ่งในหุบเขา ชายผู้นั้นได้บอกเล่าเรื่องราวต่างๆอีกมากมาย โดยเล่าว่า เมื่อประมาณ ๑๒๐๐ ปีมาแล้ว หุบเขาถํ้าเสือเป็น\
                เกาะใกล้ทะเล ครั้งหนึ่งมีชาวเมืองไทรบุรีได้ทราบข่าวการสร้างพระธาตุเมืองนครศรีธรรมราช จึงพากันนำเอาทรัพย์สินเงินทองจะมาบรรจุไว้ในพระธาตุ \
                เรือถูกพายุมาติดที่บริเวณถํ้าเสือเป็นเวลาช้านาน ผู้คนเหล่านั้นต่างล้มตายไปหลายคน ต่อมาได้ทราบว่าการสร้างพระบรมธาตุนั้นเสร็จสิ้นแล้ว พวกที่เหลือจึงเอาทรัพย์สินสมบัติฝังไว้ในถํ้า \
                ช่วยสกัดก้อนหินปากถํ้าเอาไว้ โดยอาศัยระบบนํ้าย้อยจนปากถํ้าปิดสนิทต่อมาอีกหลายร้อยปีทะเลบริเวณนี้ \
                ได้ตื้นเขินกลายเป็นป่าเสน ผู้คนได้อพยพเข้ามาตั้งหลักแหล่งที่อยู่อาศัย กลายเป็นที่พักของพวกพ่อค้าเดินทางไปมา หรือข้ามแหลมจากตะวันตกไปยังตะวันออก \
                พระอาจารย์จำเนียร สีลเสฏโฐ กล่าวว่าชายคนนี้เล่าเหมือนว่าเขารู้ประวัติศาสตร์ดีแต่จะเชื่อได้แค่ไหนขอให้พิจารณาดู หลังจากนั้นท่านก็บอกว่าไม่พบเห็นชายผู้นั้นอีกเลย \
                จึงคิดว่าเขาคงเป็นเจ้าของทรัพย์สมบัติภายในถํ้าแห่งนี้ จึงให้ชื่อว่าถํ้าคนธรรพ์ บริเวณนี้เคยมีคนเคยพบพระพุทธรูปทองคำและวัตถุมีค่าอื่นๆอีกด้วย \
                ที่ใกล้เคียงกันมีการคนพบถํ้าเล็กถํ้าน้อยอีกมากมาย เช่น ถํ้าปลาไหล ถํ้าลูกธนู ถํ้าช้างแก้วเป็นต้น",//informaiton
                "จากการสำรวจทางโบราณคดีของนักโบราณคดี มีการค้นพบหลักฐานทางโบราณคดีที่สำคัญในแหล่งโบราณคดีแห่งนี้ คือ เครื่องมือหิน พระพิมพ์ดินดิบ ภาชนะดินเผาทรงกลมมีการตกแต่งลวดลายเชือกทาบและเศษภาชนะดินเผา รวมทั้งภาชนะดินเผาประเภทหม้อสามขา\
                โบราณวัตถุที่พบพระอาจารย์จำเนียร สีลเสฏโฐ ประธานสงฆ์สำนักถํ้าเสือเป็นผู้เก็บรักษาไว้ที่วัดถํ้าเสือเป็นจำนวนมาก และในบางส่วนอยู่ในความครอบครองของชาวบ้าน",//Place เป็นหลักฐานที่พบ
                "../../img/south/แหล่งโบราณคดีถํ้าเสือ/แหล่งโบราณคดีถํ้าเสือ1.jpg",
                "../../img/south/แหล่งโบราณคดีถํ้าเสือ/แหล่งโบราณคดีถํ้าเสือ2.jpg",
                "../../img/south/แหล่งโบราณคดีถํ้าเสือ/แหล่งโบราณคดีถํ้าเสือ3.jpg"
            ),
            new Detail(
                2,//ภาคใต้
                "ถํ้าอ่าวปากหมาก",//Title
                "สถานที่ตั้ง หมู่ที่ ๒ บ้านนาเขาไฟไหม้ ตำบลทับปริก อำเภอเมือง จังหวัดกระบี่",//Address
                "พระมหาอิทธิพล สุพโล และประชาชนในพื้นที่ได้ทำการขุดดินภายในถํ้าอ่าวปากหมาก เพื่อปรับสภาพพื้นที่สร้างศาลาที่พักสงฆ์บริเวณหน้าถํ้า และพบชิ้นส่วนของโครงกระดูกมนุษย์ประมาณ ๑๐ โครง \
                พร้อมทั้งเครื่องมือเครื่องใช้สมัยหิน ประเภทขวานหิน ภาชนะดินเผาลายเชือกทาบ เครื่องประดับหิน และซากสัตว์ แต่ชิ้นส่วนของโครงกระดูกได้ถูกเผาไปหมดแล้ว สำหรับเครื่องมือเครื่องใช้ \
                ทางสำนักงานศึกษาธิการอำเภอเมืองกระบี่ ได้นำไปเก็บรักษาไว้เพื่อรอการศึกษาวิเคราะห์จากนักโบราณคดีต่อไป",//Information
                "ซากโครงกระดูกมนุษย์สมัยก่อนประวัติศาสตร์ เครื่องมือหิน ภาชนะดินเผาลายเชือกทาบ ชิ้นส่วนกระดูกสัตว์",//Place เป็นหลักฐานที่พบ
                "../../img/south/ถํ้าอ่าวปากหมาก/ถํ้าอ่าวปากหมาก1.jpg",
                "../../img/south/ถํ้าอ่าวปากหมาก/ถํ้าอ่าวปากหมาก2.jpg",
                "../../img/south/ถํ้าอ่าวปากหมาก/ถํ้าอ่าวปากหมาก3.jpg"
            ),
            new Detail(
                3,//ภาคใต้
                "แหล่งโบราณคดีถํ้าหมอเขียว",//Title
                "บ้านหน้าชิง ตำบลกระบี่น้อย อำเภอเมือง จังหวัดกระบี่",//Address
                "จากคำบอกเล่าของชาวบ้านในท้องถิ่นที่มีการเรียกว่าถํ้าหมอเขียว ในอดีตมีหมอพื้นบ้านคนหนึ่งมีชื่อว่าหมอเขียว ซึ่งมีความรู้เกี่ยวกับสมุนไพรเป็นอย่างดีจนชาวบ้านเลื่อมใสและรู้จักกันดีในละแวกหมู่บ้านหน้าชิง อยู่อาศัยในถํ้าหมอเขียวเมื่อหมอเขียวเสียชีวิตลงชาวบ้านก็เรียกชื่อถํ้าที่หมอเขียวอยู่ว่าถํ้าหมอเขียว\
                โครงการวิจัยวัฒนธรรมโฮบิเนียนในประเทศไทย (The Hoabinhian Research Project in Thailand) ซึ่งเป็นโครงการศึกษาชาติพันธุ์วิทยาทางโบราณคดี ได้สำรวจพบหลักฐานบนพื้นผิวดินและระบุเป็นครั้งแรกว่า \
                ถํ้าหมอเขียวเป็นแหล่งโบราณคดีสมัยก่อนประวัติศาสตร์เมื่อปี พ.ศ ๒๕๓๔ และได้ดำเนินการขุดค้นทางโบราณคดีที่ถํ้าแห่งนี้ในปีเดียวกัน คณะผู้ดำเนินการขุดค้นและวิเคราะห์ข้อมูลด้านต่างๆที่ได้จากการขุดค้น \
                ประกอบด้วยศาสตราจารย์ ดร.สุรินทร์ ภู่ขจร อาจารย์คณะโบราณคดี มหาวิทยาศิลปากร หัวหน้าอำนวยการขุดค้น วิเคราะห์สภาพแหล่งและผลการขุดค้นตามชั้นดินวัฒนธรรม นายประพิศ ชูศิริ \
                นักโบราณคดีจากกองโบราณคดี กรมศิลปากร วิเคราะห์เรื่องโรคจากโครงกระดูกมนุษย์ นางเยาวลักษณ์ ชัยมณี วิเคราะห์กระดูกสัตว์ นายอำพล ไวศยดำรง วิเคราะห์หอย และนายมนัส วัฒนศักดิ์ \
                วิเคราะห์ละอองเกสรพืช",//Information
                "นักโบราณคดีได้ทำการสำรวจขุดค้นทางโบราณคดี เมื่อปี พ.ศ ๒๕๓๔ ได้แบ่งชั้นดินออกเป็น ๖ ชั้น จากชั้นบนลงไปชั้นล่างพบหลักฐานต่างๆดังนี้\
                - เศษภาชนะดินเผาเนื้อหยาบสีเทาเข้มและสีดำมีทั้งผิวเรียบและลายเชือกทาบ\
                - เครื่องมือหินและเครื่องมือกระดูก มักเป็นเครื่องมือหินขัดกระเทาะ เครื่องมือสะเก็ดหินและมีเครื่องมือกระดูกบ้างบางส่วน\
                - กระดูกสัตว์ ได้แก่กระดูกสัตว์ใหญ่และเปลือกหอยชนิดต่างๆ ทั้งหอยทะเลและหอยนํ้าจืด\
                - หลักฐานเกี่ยวกับเมล็ดพืช\
                - หลักฐานเกี่ยวกับกองไฟในชั้นวัฒนธรรมต่างๆ มักพบร่วมกับกระดูกสัตว์ เมล็ดพืช ขวานหิน และสะเก็ดหิน\
                - เครื่องประดับ ลูกปัดทำจากเปลือกหอย กระดูกสัตว์และแผ่นหิน\
                - หลุมฝังศพและโครงกระดูก",//Place เป็นหลักฐานที่พบ
                "../../img/south/แหล่งโบราณคดีถํ้าหมอเขียว/แหล่งโบราณคดีถํ้าหมอเขียว1.jpg",
                "../../img/south/แหล่งโบราณคดีถํ้าหมอเขียว/แหล่งโบราณคดีถํ้าหมอเขียว2.jpg",
                "../../img/south/แหล่งโบราณคดีถํ้าหมอเขียว/แหล่งโบราณคดีถํ้าหมอเขียว3.jpg"
            ),
            new Detail(
                4,//ภาคใต้
                "ชุมชนโบราณเขาสามแก้ว",//Title
                "สถานที่ตั้ง หมู่ ๑ บ้านสามแก้ว ตำบลนาชะอัง อำเภอเมือง จังหวัดชุมพร",//Address
                "ชุมชนโบราณเขาสามแก้ว ตั้งอยู่ที่ตำบลนาชะอัง อำเภอเมือง จังหวัดชุมพร สันนิษฐานว่ามีอายุประมาณ ๑,๕๐๐ ปี และน่าจะเป็นเมืองร่วมสมัยกับนครศรีธรรมราช \
                ที่ตั้งขึ้นในราวศตวรรษที่ ๑๘ เมืองโบราณที่เขาสามแก้วในอดีต น่าจะมีความเจริญรุ่งเรืองมาก่อนจากหลักฐานที่ขุดพบโดยเฉพาะกลองมโหระทึก \
                ซึ่งเป็นกลองที่มีใช้เฉพาะในราชสำนักตามลัทธิพราหมณ์ แต่สาเหตุของการเป็นเมืองร้างไม่ปรากฏชัดเจน",//Information
                "มีการขุดพบกลองมโหระทึก ซึ่งมีลักษณะคล้ายคลึงกับกลองที่ขุดพบที่เกาะสมุย จังหวัดสุราษฏร์ธานี แต่มีความแตกต่างที่ลวดลายข้างกลอง ซึ่งกรมศิลปากรได้ประมาณอายุของกลองไว้ว่าประมาณ ๑,๗๐๐ - ๒,๐๐๐ ปี \
                นอกจากนี้ยังพบว่ามีลูกปัดสีประเภทต่าง ๆ เก็บซ่อนในกลองมโหระทึกอีกจำนวนหนึ่ง",//Place เป็นหลักฐานที่พบ
                "../../img/south/ชุมชนโบราณเขาสามแก้ว/ชุมชนโบราณเขาสามแก้ว1.jpg",
                "../../img/south/ชุมชนโบราณเขาสามแก้ว/ชุมชนโบราณเขาสามแก้ว2.jpg",
                "../../img/south/ชุมชนโบราณเขาสามแก้ว/ชุมชนโบราณเขาสามแก้ว4.jpeg"
            )
        ],
        cardlist: [
            new Card(
                1,
                'content/south/first.html',
                'แหล่งโบราณคดีถํ้าเสือ',
                'img/south/แหล่งโบราณคดีถํ้าเสือ/แหล่งโบราณคดีถํ้าเสือ1.jpg',
                'จังหวัดกระบี่',
                'สมัยที่บริเวณนี้ยังเป็นป่ารก ชาวบ้านได้พบเห็นเสือโคร่งเดินเข้าออกแถบถํ้านี้อยู่เสมอจึงเรียกกันว่า ถํ้าเสือ และเป็นชื่อหมู่บ้านนี้ด้วย เมื่อพระอาจารย์ จำเนียร สีลเสฏโฐ มาบุกเบิกใหม่ๆ'
            ),
            new Card(
                2,
                'content/south/first.html',
                'ถํ้าอ่าวปากหมาก',
                'img/south/ถํ้าอ่าวปากหมาก/ถํ้าอ่าวปากหมาก1.jpg',
                'จังหวัดกระบี่',
                'สถานที่ตั้ง หมู่ที่ ๒ บ้านนาเขาไฟไหม้ ตำบลทับปริก อำเภอเมือง จังหวัดกระบี่'
            ),
            new Card(
                3,
                'content/south/first.html',
                'แหล่งโบราณคดีถํ้าหมอเขียว',
                'img/south/แหล่งโบราณคดีถํ้าหมอเขียว/แหล่งโบราณคดีถํ้าหมอเขียว1.jpg',
                'จังหวัดกระบี่',
                'จากคำบอกเล่าของชาวบ้านในท้องถิ่นที่มีการเรียกว่าถํ้าหมอเขียว ในอดีตมีหมอพื้นบ้านคนหนึ่งมีชื่อว่าหมอเขียว ซึ่งมีความรู้เกี่ยวกับสมุนไพรเป็นอย่างดีจนชาวบ้านเลื่อมใสและรู้จักกันดีในละแวกหมู่บ้านหน้าชิง อยู่อาศัยในถํ้าหมอเขียวเมื่อหมอเขียวเสียชีวิตลงชาวบ้านก็เรียกชื่อถํ้าที่หมอเขียวอยู่ว่าถํ้าหมอเขียว'
            ),
            new Card(
                4,
                'content/south/first.html',
                'ชุมชนโบราณเขาสามแก้ว',
                'img/south/ชุมชนโบราณเขาสามแก้ว/ชุมชนโบราณเขาสามแก้ว1.jpg',
                'จังหวัดชุมพร',
                'ชุมชนโบราณเขาสามแก้ว ตั้งอยู่ที่ตำบลนาชะอัง อำเภอเมือง จังหวัดชุมพร สันนิษฐานว่ามีอายุประมาณ ๑,๕๐๐ ปี และน่าจะเป็นเมืองร่วมสมัยกับนครศรีธรรมราช'
            ),
        ]
    },
    // mounted(){
    //     if(localStorage.select)
    //     this.select = localStorage.select;
    // },
    methods:{
        eiei(id){
            app.select = id;
            console.log(app.select);
            console.log(localStorage);
        },
        checkselect: function(){
            console.log(localStorage.select);
            return app.select;
        }
    },
    mounted() {
        console.log(localStorage.select);
        if (localStorage.select) {
          this.select = localStorage.select;
        }
      },
    watch: {
        select(newName) {
          localStorage.select = newName;
        }
    },
    computed: {
        filterCard() {
            return this.cardlist.filter(card => {
                return card.title.includes(this.search) || card.location.includes(this.search);
            })
        }
    },
})