class Card {
    constructor(id, link, title, img, location, text) {
        this.id = id;
        this.link = link;
        this.title = title;
        this.img = img;
        this.location = location;
        this.text = text;
    }
}

class Detail {
    constructor(id, title, address, information, place, image1, image2, image3){
        this.id = id;
        this.title = title;
        this.address = address;
        this.information = information;
        this.place = place;
        this.image1 = image1;
        this.image2 = image2;
        this.image3 = image3;

    }
}

const app = new Vue({
    el: '#app',
    data: {
        search: '',
        select: 0,
        informationlist: [
            new Detail(
                1,//ภาคตะวันออกเฉียงเหนือ
                "แหล่งโบราณคดีโนนเมือง",//Title
                "ตั้งอยู่ที่บ้านโนนเมือง อำเภอชุมแพ จังหวัดขอนแก่น",//Address
                "จากการสำรวจและขุดค้นโดยหน่วยศิลปากรที่ ๗ จังหวัดขอนแก่น เมื่อ พ.ศ ๒๕๒๕-๒๕๒๖ พบว่าบ้านโนนเมืองมีความเก่าแก่ถึง ๓ ช่วงสมัยติดต่อกัน คือ สมัยก่อนประวัติศาสตร์ตอนปลายอายุราว ๓,๐๐๐ ปี \
                สมัยประวัติศาสตร์ตอนต้นเรียกว่าสมัยทวาราวดี ราวพุทธศตวรรษที่ ๑๓-๑๖ และสมัยประวัติศาสตร์เรียกว่า ลพบุรี ราวพุทธศตวรรษที่ ๑๖-๑๙ มีคูน้ำและคันดินรูปกลมรี เป็นแหล่งพิพิธภัณฑ์กลางแจ้งมีหลุมขุดค้นสาธิตขนาดใหญ่ ๗ หลุม",//Information
                "ใบเสมาหินทรายกระจายอยู่ทั่วไป คูเมืองขนาดใหญ่แสดงให้เห็นชุมชนซึ่งเป็นศูนย์กลาง และชุมชนย่อยกระจายอยู่โดยรอบ ซึ่งเป็นที่อยู่อาศัยของคนสมัยก่อนประวัติศาสตร์และสมัยประวัติศาสตร์ \
                มีโครงกระดูกมนุษย์โบราณฝังอยู่เป็นระเบียบและสมบูรณ์ มีเครื่องใช้ กำไลมือ กำไลเท้าที่อุทิศให้แก่ศพ และเครื่องปั้นดินเผาแบบต่าง ๆ มีใบเสมาสมัยทวาราวดีเป็นจำนวนมาก หนึ่งในนั้นได้นำไปทำเป็นเสาหลักเมืองของเทศบาลนครขอนแก่น",//Place เป็นหลักฐานที่พบ
                '../../img/east/แหล่งโบราณคดีโนนเมือง/แหล่งโบราณคดีโนนเมือง1.jpg',
                '../../img/east/แหล่งโบราณคดีโนนเมือง/แหล่งโบราณคดีโนนเมือง2.jpg',
                '../../img/east/แหล่งโบราณคดีโนนเมือง/แหล่งโบราณคดีโนนเมือง3.jpg',
            ),
            new Detail(
                2,//ภาคตะวันออกเฉียงเหนือ
                "เมืองฟ้าแดดสงยาง",//Title
                "บ้านก้อม ตำบลหนองแปน อำเภอกมลาไสย จังหวัดกาฬสินธุ์",//Address
                "เมืองฟ้าแดดสงยาง เป็นเมืองในยุคโบราณ สร้างขึ้นในราวพุทธศตวรรษที่ ๑๒-๑๖ ประมาณ ๑,๔๐๐ ปีล่วงมาแล้ว มีชื่อเรียกหลายชื่อ เช่น คนพื้นเมืองเรียก ฟ้าแดดสูงยาง \
                ในบทวรรณกรรมท้องถิ่นเรียก ฟ้าแดดสงยาง เรียกตามชื่อบ้านเรียก บ้านเสมา ตามประวัติศาสตร์สมัยพระเจ้าฟ้างุ้ม แห่งกรุงศรีสัตนาคนหุต เรียก โนนผึ่งแดดหรือโพนผึ่งแดด เป็นต้น \
                เมืองฟ้าแดดสงยาง มีพื้นที่ประมาณ ๓๐๐-๕๐๐ ไร่ แผนผังเมืองเป็น วงรีมี มีคันดินล้อมรอบเป็นคูเมืองสองชั้นวัดโดยรอบมีความยาวประมาณ ๕ กิโลเมตร ขนาดผังเมืองยาว ๒,๐๐๐ เมตร \
                กว้างประมาณ ๑,๓๕๐ เมตร ส่วนประตูเมืองไม่ทราบแน่ชัดแต่สันนิษฐานว่าอยู่ตรงคูเมืองทั้ง ๔ ทิศ ภายในบริเวณเมืองเก่ามีร่องรอยโบราณสถานอยู่หลายแห่ง",//Information
                "หลักฐานที่พบ ร่องรอยของศาสนสถาน ๑๔ แห่ง ลักษณะของแผนผังศาสนสถานที่สร้างขึ้นตามคติในพุทธศาสนา เป็นศิลปกรรมแบบทวารวดี พระธาตุยาคู ใบเสมาหินทรายสีแดง ที่มีทั้งเป็นแท่งหินกลม \
                เหลี่ยมและแผ่นศิลา ทั้งแบบแผ่นหินทรายเกลี้ยง แผ่นหินทรายสลักลวดลาย และมีจารึกตัวอักษรโบราณ ที่พบส่วนใหญ่ไม่มีลวดลาย ส่วนแผ่นที่มีลวดลายมักเป็นเสมารูปกลีบบัว จำหลักเป็นลายสถูปแบบทวารวดี \
                ภาพสำคัญคือภาพจำหลักเรื่องราวพุทธประวัติ และมหานิบาติชาดกที่งดงามมาก ทำให้ทราบถึงคติความเชื่อความนิยม รวมถึงการแต่งกายและสถาปัตยกรรมเครื่องไม้ในสมัยนั้น \
                เมืองฟ้าแดดสงยางจึงนับเป็นแหล่งเสมาหินใหญ่และสำคัญที่สุดในภาคตะวันออกเฉียงเหนืออีกด้วย ซึ่งใบเสมาในจำนวนนี้กว่า ๑๓๐ แผ่น ที่กรมศิลปากรขึ้นทะเบียนไว้ \
                ได้ถูกเคลื่อนย้ายไปเก็บรักษาไว้ที่ พิพิธภัณฑสถานแห่งชาติ จังหวัดขอนแก่น นอกจากนี้ยังพบพระพิมพ์ดินเผา เป็นงานอิทธิพลสกุลช่างฝีมือคุปตะ รุ่นหลัง อายุราว ๑,๐๐๐-๒,๐๐๐ ปี \
                ลูกปัด เครื่องประดับ เครื่องปั้นดินเผา กล้องยาสูบดินเผาลวดลายอมราวดีก้านขดเป็นรูปตัวมังกร อายุ ๗,๐๐๐ ปี และที่น่าสนใจคือ กล้องยาสูบชนิดเดียวกันแต่ทำด้วยทองสัมฤทธิ์ อายุ ๕,๐๐๐-๖,๐๐๐ ปี \
                เป็นเครื่องยืนยันว่ายุคโลหะของสุวรรณภูมิได้เริ่มขึ้นในบริเวณนี้ก่อนทุกๆ ที่ในโลก นอกจากนี้ยังพบโครงกระดูกมนุษย์ปะปนอยู่ในหลุมขุดภายในบริเวณเมืองโบราณนี้ด้วย",//Place เป็นหลักฐานที่พบ
                '../../img/east/เมืองฟ้าแดดสงยาง/เมืองฟ้าแดดสงยาง1.jpg',
                '../../img/east/เมืองฟ้าแดดสงยาง/เมืองฟ้าแดดสงยาง2.jpg',
                '../../img/east/เมืองฟ้าแดดสงยาง/เมืองฟ้าแดดสงยาง3.jpg',
            ),
            new Detail(
                3,//ภาคตะวันออกเฉียงเหนือ
                "พระธาตุยาคู",//Title
                "บ้านเสมา อำเภอกมลาไสย จังหวัดกาฬสินธุ์",//Address
                "เจดีย์ทรง ๘ เหลี่ยม ใบเสมาหินทราย จากการตรวจสอบหลักฐานสันนิษฐานว่าสร้างในสมัยทวารวดี ต่อมาคงปรักหักพังไปตามกาลเวลาและเพราะขาดการดูแลเอาใจใส่ ต่อมาในสมัยกรุงศรีอยุธยา \
                คงสร้างเจดีย์ทรงแปดเหลี่ยม ก่ออิฐถือปูนซ้อนทับฐานเดิมและในสมัยกรุงรัตนโกสินทร์คงมีการสร้างต่อเติมส่วนยอดให้สูงขึ้นอีก จนกระทั่งถึง พ.ศ.๒๕๑๐-๒๕๒๒ กรมศิลปากรได้ทำการขุดแต่งและบูรณะ\
                เจดีย์องค์นี้ รวมทั้งได้จดทะเบียนเป็นโบราณสถานพระธาตุยาคูนี้ชาวบ้านเชื่อกันว่า เป็นเจดีย์ที่บรรจุอัฐิของพระเถระชั้นผู้ใหญ่ ที่ชาวเมืองเคารพนับถือ จึงจัดให้มีเทศกาลบูชาพระธาตุประจำปี \
                ระหว่างเดือนเมษายนถึงเดือนพฤษภาคม เพื่อขอฝนและความสงบร่มเย็นแก่หมู่บ้านลักษณะทั่วไปเป็นพระธาตุเจดีย์ขนาดใหญ่ที่สุดในบริเวณเมืองฟ้าแดดสงยาง \
                ก่อด้วยอิฐดินเป็นเจดีย์ทรง ๘ เหลี่ยมย่อมุมไม้ ๑๒ มีขนาดฐานกว้าง ๑๐ เมตร ยาว ๑๐ เมตร สร้างซ้อนกันในลักษณะเป็นจตุรมุข มีบันไดทางขึ้น ๔ ทิศ ความสูงวัดจากฐานถึงยอดสูง ๘ เมตร",//Information
                "หลักฐานที่พบ จดีย์ทรง ๘ เหลี่ยม ใบเสมาหินทราย",//Place เป็นหลักฐานที่พบ
                '../../img/east/พระธาตุยาคู/พระธาตุยาคู1.jpg',
                '../../img/east/พระธาตุยาคู/พระธาตุยาคู2.jpg',
                '../../img/east/พระธาตุยาคู/พระธาตุยาคู3.jpg',
            ),
            new Detail(
                4,//ภาคตะวันออกเฉียงเหนือ
                "ปรางค์กู่",//Title
                "ตั้งอยู่ที่บ้านหนองบัว ตำบลในเมือง เขตอำเภอเมือง อยู่ห่างจากตัวจังหวัดประมาณ ๓ กิโลเมตร",//Address
                "ปรางค์กู่ เป็นอโรคยาศาลสร้างขึ้นสมัยพระเจ้าชัยวรมันที่ ๗ ระหว่าง พ.ศ. ๑๗๒๔-๑๗๖๓ หรือพุทธศตวรรษที่ ๑๘ มีข้อความว่าให้อยู่ใต้พระบารมีของพระพุทธเจ้า ผู้ทรงการแพทย์คือ \
                พระไภษัชยคุรุไวทูรยประภา ผู้ประทานความสุขเกษมและความไม่มีโรคให้แก่ประชาชน ปัจจุบันเป็นโบราณสถานที่สำคัญและมีสภาพสมบูรณ์ที่สุดแห่งหนึ่งในจังหวัดชัยภูมิ ปรางค์กู่เป็นปราสาทอีกแห่งหนึ่ง \
                ที่มีแผนผังและลักษณะเช่นเดียวกับปราสาทที่ได้พบหลักฐานว่าเป็นอโรคยาศาล ที่สร้างขึ้นในพุทธศตวรรษที่ ๑๘ นั่นคือ มีปรางค์ประธานอยู่ตรงกลาง ๑ องค์ วิหารหรือบรรณาลัยด้านหน้า ๑ หลัง \
                ล้อมรอบด้วยกำแพงซึ่งมีโคปุระเฉพาะด้านหน้าทั้งหมด ก่อด้วยศิลาแลงยกเว้นกรอบประตูหน้าต่าง ทับหลัง เสาประดับเป็นหินทราย หันหน้าไปทางทิศตะวันออก \
                นอกกำแพงตรงมุมทิศตะวันออกเฉียงเหนือมีสระน้ำ ๑ สระ ยังคงสภาพสมบูรณ์ดีมาก โดยเฉพาะปรางค์ประธานซึ่งมีผังเป็นรูปสี่เหลี่ยมจัตุรัสขนาด ๕ เมตร ย่อมุมไม้สิบสอง \
                ด้านหน้ามีประตูเข้าออกทำเป็นมุขยื่นออกมา ผนังปรางค์อีก ๓ ด้านเป็นประตูหลอก เหนือประตูหลอกด้านทิศเหนือยังคงมีทับหลังติดอยู่ จำหลักภาพตรงกลางเป็นพระพุทธรูปประทับนั่งปางสมาธิเหนือหน้ากาล \
                ซึ่งจับท่อนพวงมาลัยไว้ด้วยมือทั้งสองข้าง ด้านข้างทางซ้ายและขวาจำหลักรูปพระโพธิสัตว์อวโลกิเตศวร ๔ กร กับรูปนางปรัชญาปารมิตา ด้านหน้ามีทับหลังเช่นกัน \
                สันนิษฐานว่าสลักเป็นภาพเดียวกัน แต่ปัจจุบันลบเลือนมาก ที่ช่องประตูหลอกด้านทิศเหนือยังมีพระพุทธรูปศิลาปางสมาธิ ศิลปะแบบทวาราวดี ขนาดสูง ๑.๗๕ เมตร หน้าตักกว้าง ๗.๕ เมตร \
                ประดิษฐานอยู่ ๑ องค์ ซึ่งเป็นของที่เคลื่อนย้ายมาจากที่อื่น นอกจากนี้ยังพบทับหลังและองค์ประกอบสถาปัตยกรรมอื่น ๆ เช่น เสาประดับประตู",//Information
                "นอกกำแพงตรงมุมทิศตะวันออกเฉียงเหนือมีสระน้ำ ๑ สระ ยังคงสภาพสมบูรณ์ดีมาก โดยเฉพาะปรางค์ประธานซึ่งมีผังเป็นรูปสี่เหลี่ยมจตุรัส ขนาด ๕ เมตร \
                ย่อมุมไม้สิบสองด้านหน้ามีประตูเข้าออกทำเป็นมุขยื่นออกมา ผนังปรางค์มี ๓ ด้าน เป็นประตูหลอก เหนือประตูหลอกด้านทิศเหนือยังมีทับหลังติดอยู่ \
                จำหลักภาพตรงกลางเป็นพระพุทธรูปประทับนั่งปางสมาธิเหนือกาล ซึ่อถือพวงมาลัยไว้ด้วยมือทั้งสองข้าง ด้านข้างทางซ้ายและขวาจำหลักรูปพระโพธิสัตว์อวโลกิเตศวร ๔ กร \
                กับรูปนางปรัชญาปารมิตาด้านหน้ามีทับหลังเช่นกัน สันนิษฐานว่าสลักเป็นภาพเดียวกัน แต่ปัจจุบันลบเลือนมากที่ช่องประตูหลอกด้านทิศเหนือยังมีพระพุทธรูปศิลาปางสมาธิ \
                ศิลปะแบบทวาราวดี ขนาดสูง ๑.๗๕ เมตร หน้าตักกว้าง ๗.๕ เมตร ประดิษฐานอยู่ ๑ องค์ ซึ่งเป็นของที่เคลื่อนย้ายมาจากที่อื่นนอกจากนี้ยังพบทับหลังและองค์ประกอบสถาปัตยกรรมอื่นๆ \
                เช่น เสาประดับประตู",//Place เป็นหลักฐานที่พบ
                )
        ],
        cardlist: [
            new Card(
                1,
                'content/east/first.html',
                'แหล่งโบราณคดีโนนเมือง',
                'img/east/แหล่งโบราณคดีโนนเมือง/แหล่งโบราณคดีโนนเมือง1.jpg',
                'จังหวัดขอนแก่น',
                'brand new hotel in pattaya! i\'ve always thought the what ever photos they post in agoda doesnt really look like what theactual hotel is.but i was wrong, beside the hotel is'
            ),
            new Card(
                2,
                'content/east/first.html',
                'เมืองฟ้าแดดสงยาง',
                'img/east/เมืองฟ้าแดดสงยาง/เมืองฟ้าแดดสงยาง4.jpg',
                'จังหวัดกาฬสินธุ์',
                'brand new hotel in pattaya! i\'ve always thought the what ever photos they post in agoda doesnt really look like what theactual hotel is.but i was wrong, beside the hotel is'
            ),
            new Card(
                3,
                'content/east/first.html',
                'พระธาตุยาคู',
                'img/east/พระธาตุยาคู/พระธาตุยาคู2.jpg',
                'จังหวัดกาฬสินธุ์',
                'brand new hotel in pattaya! i\'ve always thought the what ever photos they post in agoda doesnt really look like what theactual hotel is.but i was wrong, beside the hotel is'
            ),
            new Card(
                4,
                'content/noth/first.html',
                'วัดสมเด็จพระนารายณ์มหาราช',
                'img/noth/วัดสมเด็จพระนารายณ์มหาราช/วัดสมเด็จพระนารายณ์มหาราช1.jpg',
                'จังหวัดตาก',
                'brand new hotel in pattaya! i\'ve always thought the what ever photos they post in agoda doesnt really look like what theactual hotel is.but i was wrong, beside the hotel is'
            ),
        ]
    },
    // mounted(){
    //     if(localStorage.select)
    //     this.select = localStorage.select;
    // },
    methods:{
        eiei(id){
            app.select = id;
            console.log(app.select);
            console.log(localStorage);
        },
        checkselect: function(){
            console.log(localStorage.select);
            return app.select;
        }
    },
    mounted() {
        console.log(localStorage.select);
        if (localStorage.select) {
          this.select = localStorage.select;
        }
      },
    watch: {
        select(newName) {
          localStorage.select = newName;
        }
    },
    computed: {
        filterCard() {
            return this.cardlist.filter(card => {
                return card.title.includes(this.search) || card.location.includes(this.search);
            })
        }
    },
})