class Card {
    constructor(id, link, title, img, location, text) {
        this.id = id;
        this.link = link;
        this.title = title;
        this.img = img;
        this.location = location;
        this.text = text;
    }
}

class Detail {
    constructor(id, title, address, information, place, image1, image2, image3){
        this.id = id;
        this.title = title;
        this.address = address;
        this.information = information;
        this.place = place;
        this.image1 = image1;
        this.image2 = image2;
        this.image3 = image3;

    }
}

const app = new Vue({
    el: '#app',
    data: {
        search: '',
        select: 0,
        informationlist: [
            new Detail(
                1,//id  ภาคเหนือ
                "อุทยานประวัติศาสตร์กำแพงเพชร",//title
                "อุทยานประวัติศาสตร์กำแพงเพชร ตั้งอยู่ในเขตอำเภอเมืองทางฝั่งตะวันออกของแม่น้ำปิง มีพื้นที่ประมาณ 3.4 ตารางกิโลเมตร แบ่งออกเป็น 2 เขต คือ เขตภายในกำแพงเมือง พื้นที่ 503 ไร่ \
                และเขตนอกกำแพงเมืองหรือที่เรียกกันว่าเขตอรัญญิก พื้นที่ 1,611 ไร่ ตั้งอยู่บนเขาลูกรังขนาดย่อม โบราณสถานทั้ง 2 กลุ่ม ตั้งอยู่ในพื้นที่ตั้งของตัวจังหวัดกำแพงเพชร \
                ซึ่งอยู่ห่างจากกรุงเทพมหานครไปทางทิศเหนือ ประมาณ 358 กิโลเมตร กรมศิลปากรได้กำหนดเขตที่ดินโบราณสถานอุทยานประวัติศาสตร์กำแพงเพชร ประมาณ 2,114 ไร่",//Address
                "ในบริเวณที่ตั้งจังหวัดกำแพงเพชรปัจจุบันได้ค้นพบหลักฐานเมืองโบราณในลุ่มแม่น้ำปิง คือ เมืองแปบ เมืองเทพนคร เมือง ไตรตรึงษ์ เมืองพาน เมืองนครชุม และเมืองชากังราว เพราะความอุดมสมบูรณ์ของลุ่มน้ำปิง \
                ทำให้เกิดการตั้งบ้านเมืองทำมาหากิน ซึ่งแต่ละเมืองอยู่ไม่ห่างกันมากนัก เมืองที่ตั้งในยุคแรก ๆ น่าจะเป็นเมืองแปบที่มีตำนานเล่าว่าเป็นเมืองที่ตั้งอยู่ฝั่งนครชุม บริเวณ ตรงกันข้ามกับเมืองกำแพงเพชรในปัจจุบัน\
                 จากหลักฐานจารึกหลักที่ 3 (ศิลาจารึกนครชุม) พ.ศ. 1900 กล่าวถึงเหตุการณ์ที่ พระมหาธรรมราชาที่ 1 (ลิไท) เสด็จไป พระบรมธาตุ เมืองนครชุมว่า “หากเอาพระศรีรัตนมหาธาตุอันนี้มาสถาปนาในเมืองนครชุม” \
                 เมืองนครชุมน่าจะเป็นเมืองใหญ่และมี ความสำคัญในสมัยสุโขทัย แต่มาหมดอำนาจและเป็นเมืองเล็กๆ ในสมัยอยุธยา \
                 ส่วนเมืองชากังราวยังคงมีอำนาจอยู่ในฝั่งตะวันออก และเรียกชื่อเมืองว่า กำแพงเพชรในสมัยอยุธยา เพราะหลังจากพระมหาธรรมราชาลิไทสวรรคต (พ.ศ. 1913 – 1914) เมืองต่าง ๆ ในแคว้นสุโขทัยแตกแยก บางเมืองหันมาเป็นพันธมิตรกับอยุธยา \
                 ชื่อเมืองกำแพงเพชรปรากฏ ในศิลาจารึกหลักที่ 38 หรือจารึก กฎหมายลักษณะโจรกล่าวพระนามจักรพรรดิราชได้ขึ้นเสวยราชสมบัติที่เมืองกำแพงเพชร เมื่อ พ.ศ. 1940 เชื่อกันว่ากษัตริย์อยุธยา ต้องการให้ศูนย์กลางของอำนาจจากเมืองนครชุมเดิม \
                 ย้ายมาอยู่ที่เมืองชากังราวหรือกำแพงเพชรนั่นเอง และภายหลังการ เสียกรุงศรีอยุธยาครั้งที่ 2 พ.ศ. 2530 เมืองกำแพงเพชร ได้ลดบทบาทลงและคงจะร้างไปในที่สุด \
                 กลุ่มโบราณสถานเขตอรัญญิกของอุทยานประวัติศาสตร์กำแพงเพชร มีโบราณสถานรวมกลุ่มกันหนาแน่นในบริเวณที่ต่อเนื่อง เป็นผืนเดียวกัน ฃนอกจากนี้สภาพภูมิประเทศโดยรอบโบราณสถานยังเป็นป่าธรรมชาติที่มีการอนุรักษ์ไว้เป็นอย่างดี เพื่อคงไว้ซึ่ง บรรยากาศของโบราณสถานในเขตอรัญญิกหรืออรัญวาสีเช่นวันเวลาในอดีต\
                 อุทยานประวัติศาสตร์กำแพงเพชรได้รับการยกย่องให้เป็นมรดกโลกทางวัฒนธรรมในปี พ.ศ.2534 ร่วมกับอุทยานประวัติศาสตร์ สุโขทัย ศรีสัชนาลัย เนื่องจากหลักฐานที่ปรากฏแสดงให้เห็นถึงความงดงามอลังการของศิลปกรรมไทยในยุคแรกๆ ผลงานทาง ศิลปกรรมที่เป็นเลิศนี้ปรากฏอยู่เป็นจำนวนมากในอุทยานประวัติศาสตร์ทั้ง 3 แห่ง \
                 สมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี เสด็จพระราชดำเนินเป็นองค์ประธานในพิธีเปิดอุทยานอย่างเป็นทางการเมื่อวันที่ 8 เมษายน พ.ศ.2534",//information
                "โบราณสถานภายในกำแพงเมืองสำรวจพบแล้วมีทั้งสิ้น 20 แห่ง ที่สำคัญ คือ วัดพระแก้ว วัดพระธาตุ วัดโบราณ หรือ สระมน ศาลพระอิศวร วัดกลางนคร เป็นต้น\
                 โบราณสถานนอกกำแพงเมืองโดยทั่วไปเรียกกันว่า “เขตอรัญญิก” ตั้งอยู่นอกกำแพงเมืองด้านทิศเหนือ มีพื้นที่ประมาณ 1,611 ไร่ ตั้งอยู่บนเขาลูกรังขนาดย่อม สำรวจพบโบราณสถานแล้ว 37 แห่ง \
                 ที่สำคัญคือ วัดพระนอน วัดพระสี่อิริยาบถ วัดช้างรอบ วัดอาวาสใหญ่ วัดฆ้องชัย วัดอาวาสน้อย วัดเชิงหวาย วัดดงหวาย วัดช้าง และวัดกะโลทัย เป็นต้น ส่วนโบราณสถานที่ตั้งอยู่ฟากตะวันตกของแม่น้ำปิง \
                 ทั้งภายในและภายนอกเมืองนครชุม ก็ยังมีกลุ่มโบราณสถานที่สำคัญตั้งอยู่ ภายใน เมืองนครชุมมีวัดพระบรมธาตุและวัดซุ้มกอ เป็นต้นส่วนที่อยู่นอกเมืองนครชุม ได้แก่ ป้อมทุ่งเศรษฐี วัดหนองพิกุล วัดหม่องกาเล และ วัดเจดีย์กลางทุ่ง เป็นต้น",//place
                 "../../img/noth/1/11.jpg",
                 "../../img/noth/1/12.jpg",
                 "../../img/noth/1/14.jpeg"
                ),
            new Detail(
                2,//id ภาคเหนือ
                "เมืองโบราณเวียงกาหลง",//Titile
                "สถานที่ตั้ง เมืองโบราณเวียงกาหลงตั้งอยู่บนเทือกเขาดอยดงในเทือกเขาดอยหลวง ในเขตบ้านป่าส้าน หมู่ที่ ๕ ตำบลหัวฝาย อำเภอเวียงป่าเป้า จังหวัดเชียงราย",//Address
                "เมืองโบราณเวียงกาหลงเป็นผังเมืองที่ไม่เป็นรูปทรงเรขาคณิตเช่นเดียวกับเมืองโบราณส่วนใหญ่ในภาคเหนือ ตัวเมืองตั้งอยู่บนเนินเขา มีกำแพงคันดินและคูเมืองล้อมรอบ แบ่งออกเป็นสองส่วนใหญ่ๆ คือ\
                ส่วนที่หนึ่ง เป็นรูปสี่เหลี่ยมเกือบจัตุรัสมุมมน มีคูเมืองอยู่ระหว่างกำแพงคันดินสองชั้น แบ่งพื้นที่ภายในเมืองออกเป็นหลายส่วน มีส่วนกำแพงคันดินถูกตัดขาดออกเป็นทางเดินหลายแห่งลักษณะคล้ายประตูเมือง\
                ส่วนที่สอง เป็นรูปรียาวต่อจากส่วนที่หนึ่งขึ้นไปทางทิศเหนือตามแนวเทือกเขา กำแพงคันดินสองชั้นขนาบคูเมืองอยู่ตรงกลางแนวกำแพงเมืองด้านตะวันออกขนานไปกับแนวสันเขาสูงชัน ด้านตะวันตกสร้างอยู่บนลาดเนินเขา \
                พื้นที่เมืองโบราณเวียงกาหลงมีทั้งหมดประมาณ ๔๓๐.๙๓๗๕ ไร่ คูเมืองและกำแพงคันดินโดยรอบยาว ๓,๓๕๐ เมตร",//Information
                "หลักฐานที่พบ คูเมืองและกำแพงคันดิน คูเมืองเมืองโบราณเวียงกาหลงขุดเป็นรูปคล้ายตัววี กว้างประมาณ ๑๘ เมตรลึก ๘.๘๐ เมตร กำแพงเมืองเป็นคันดินที่เกิดจากการขุดคูเมืองตรงกลางขึ้นมาถมทั้งสองข้าง \
                กำแพงเมืองชั้นในสูงกว่าด้านนอก ไม่พบว่ามีการใช้วัสดุอื่นมาช่วยเสริมความมั่นคงแข็งแรงของกำแพงเมืองเลยในการสำรวจและขุดค้นในแหล่งโบราณคดีเมืองโบราณเวียงกาหลง พบโบราณวัตถุต่างๆ \
                มากมายจำแนกเป็นโบราณวัตถุที่เป็นสิ่งประดิษฐ์ (Finds) เช่น เศษภาชนะดินเผา เศษกระเบื้องดินเผา อิฐ เบี้ยดินเผาดินเผาไฟ เครื่องมือเหล็ก หินลับมีด เป็นต้น \
                และโบราณวัตถุที่ไม่เป็นสิ่งประดิษฐ์ (Non Finds) เช่น ถ่านไม้กระดูกสัตว์ ดินเผาไฟ ขี้แร่ เป็นต้น",//Place เป็นหลักฐานที่พบ
                "../../img/noth/เมืองโบราณเวียงกาหลง/เมืองโบราณเวียงกาหลง1.jpg", 
                "../../img/noth/เมืองโบราณเวียงกาหลง/เมืองโบราณเวียงกาหลง2.jpg",
                "../../img/noth/เมืองโบราณเวียงกาหลง/เมืองโบราณเวียงกาหลง3.jpg"
            ),
            new Detail(
                3,//ภาคเหนือ
                "เจดีย์คู่",//Title
                "ตั้งอยู่เชิงสะพานกิตติขจรฝั่งตะวันตก ในบริเวณวัดสมเด็จพระนารายณ์มหาราช ตำบลแม่ท้อ อำเภอเมือง จังหวัดตาก",//Address
                "สมเด็จกรมพระยาดำรงราชานุภาพสันนิษฐานว่า เจดีย์คู่นี้สร้างไว้แต่ครั้งสมเด็จพระนเรศวรมหาราชกับสมเด็จพระเอกาทศรถ เมื่อคราวตีได้เมืองเชียงใหม่กลับคืนมาเป็นของไทย \
                ทรงสร้างขึ้นเพื่อเป็นอนุสรณ์ครั้งกระนั้น ต่อมาของเดิมคงจะชำรุดทรุดโทรมลง สมเด็จพระนารายณ์มหาราชจึงโปรดให้บูรณะขึ้นใหม่ ลักษณะทั่วไป\
                จะเป็นเจดีย์คู่กัน ๒ องค์ ที่กำแพงและฐานเจดีย์ทำเป็นช่องสำหรับตามประทีปโดยรอบ",//Information
                "หลักฐานที่พบ เจดีย์คู่ ๒ องค์นี้ เป็นฝีมือช่างอยุธยา ที่ฐานเจดีย์มีช่องสำหรับตามประทีปโดยรอบ เป็นหลักฐานว่าน่าจะเป็นของที่สร้างหรือปฏิสังขรณ์แต่ครั้งแผ่นดินสมเด็จพระนารายณ์มหาราช เพราะช่องตามประทีปซึ่งทำไว้ตามกำแพงและฐานเจดีย์นั้นเป็นของที่นิยมสร้างในสมัยแผ่นดินสมเด็จพระนารายณ์มหาราช",//Place เป็นหลักฐานที่พบ
                "../../img/noth/เจดีย์คู่/เจดีย์คู่1.jpg",
                 "../../img/noth/เจดีย์คู่/เจดีย์คู่2.jpg",
                 "../../img/noth/เจดีย์คู่/เจดีย์คู่3.jpg"

            ),
            new Detail(
                4,//ภาคเหนือ
                "วัดสมเด็จพระนารายณ์มหาราช",//Title
                "ตั้งอยู่เชิงสะพานกิตติขจรฝั่งตะวันตกในตัวเมืองจังหวัดตาก ตำบลแม่ท้อ อำเภอเมือง จังหวัดตาก",//Address
                "สมเด็จฯ กรมพระยาดำรงราชานุภาพ เมื่อเสด็จมาถึงเนินเขาแก้วในคราวล่องแก่งแม่น้ำปิงใน พ.ศ. ๒๔๖๔ ได้เสด็จขึ้นไปตรวจวัดนี้ ทรงพบช่องตามประทีปที่กำแพงรอบอุโบสถ จึงทรงสันนิษฐานว่า \
                สมเด็จพระนารายณ์มหาราชน่าจะทรงโปรดให้สร้างเฉลิมพระเกียรติพระองค์ที่ทรงตีเมืองเชียงใหม่ได้ หลังเสด็จกลับจากเมืองเชียงใหม่ใน พ.ศ. ๒๒๐๕ วัดสมเด็จพระนารายณ์มหาราช ตั้งอยู่บนเนินเขาแก้ว \
                ใต้วัดดอยข่อยเขาแก้วลงไปประมาณ ๑,๒๐๐ เมตร มีพระอุโบสถ ซึ่งผูกพัทธสีมาสองชั้น มีกำแพงแก้วรอบพระอุโบสถ ทางกำแพงด้านในทำเป็นช่องเล็ก ๆ สำหรับตามประทีปรอบอุโบสถ ทั้ง ๔ ด้าน",//Information
                "หลักกฐานที่พบ ซากพระอุโบสถ และช่องตามประทีปทางกำแพงด้านในทั้ง ๔ ด้าน เหมือนที่พระนารายณ์ราชนิเวศน์ จังหวัดลพบุรี และรูปทรงลักษณะของพระอุโบสถและกำแพงแก้วที่ยังเหลืออยู่ เป็นฝีมือช่างสมัยกรุงศรีอยุธยาเช่นกัน",//Place เป็นลักฐานที่พบ
                "../../img/noth/วัดสมเด็จพระนารายณ์มหาราช/วัดสมเด็จพระนารายณ์มหาราช1.jpg",
                 "../../img/noth/วัดสมเด็จพระนารายณ์มหาราช/วัดสมเด็จพระนารายณ์มหาราช2.jpg",
                 "../../img/noth/วัดสมเด็จพระนารายณ์มหาราช/วัดสมเด็จพระนารายณ์มหาราช3.jpg"
            )
        ],
        cardlist: [
            new Card(
                1,
                'content/noth/first.html',
                'อุทยานประวัติศาสตร์กำแพงเพชร',
                'img/noth/1/14.jpeg',
                'จังหวัดกำแพงเพชร',
                'อุทยานประวัติศาสตร์กำแพงเพชร ตั้งอยู่ในเขตอำเภอเมืองทางฝั่งตะวันออกของแม่น้ำปิง มีพื้นที่ประมาณ 3.4 ตารางกิโลเมตร แบ่งออกเป็น 2 เขต คือ เขตภายในกำแพงเมือง พื้นที่ 503 ไร่'
            ),
            new Card(
                2,
                'content/noth/first.html',
                'เมืองโบราณเวียงกาหลง',
                'img/noth/เมืองโบราณเวียงกาหลง/เมืองโบราณเวียงกาหลง4.jpeg',
                'จังหวัดเชียงราย',
                'สถานที่ตั้ง เมืองโบราณเวียงกาหลงตั้งอยู่บนเทือกเขาดอยดงในเทือกเขาดอยหลวง ในเขตบ้านป่าส้าน หมู่ที่ ๕ ตำบลหัวฝาย อำเภอเวียงป่าเป้า จังหวัดเชียงราย'
            ),
            new Card(
                3,
                'content/noth/first.html',
                'เจดีย์คู่',
                'img/noth/เจดีย์คู่/เจดีย์คู่1.jpg',
                'จังหวัดตาก',
                'ตั้งอยู่เชิงสะพานกิตติขจรฝั่งตะวันตก ในบริเวณวัดสมเด็จพระนารายณ์มหาราช ตำบลแม่ท้อ อำเภอเมือง จังหวัดตาก'
            ),
            new Card(
                4,
                'content/noth/first.html',
                'วัดสมเด็จพระนารายณ์มหาราช',
                'img/noth/วัดสมเด็จพระนารายณ์มหาราช/วัดสมเด็จพระนารายณ์มหาราช1.jpg',
                'จังหวัดตาก',
                'ตั้งอยู่เชิงสะพานกิตติขจรฝั่งตะวันตกในตัวเมืองจังหวัดตาก ตำบลแม่ท้อ อำเภอเมือง จังหวัดตาก'
            ),
        ]
    },
    // mounted(){
    //     if(localStorage.select)
    //     this.select = localStorage.select;
    // },
    methods:{
        eiei(id){
            app.select = id;
            console.log(app.select);
            console.log(localStorage);
        },
        checkselect: function(){
            console.log(localStorage.select);
            return app.select;
        }
    },
    mounted() {
        console.log(localStorage.select);
        if (localStorage.select) {
          this.select = localStorage.select;
        }
      },
    watch: {
        select(newName) {
          localStorage.select = newName;
        }
    },
    computed: {
        filterCard() {
            return this.cardlist.filter(card => {
                return card.title.includes(this.search) || card.location.includes(this.search);
            })
        }
    },
})