class Card {
    constructor(id, link, title, img, location, text) {
        this.id = id;
        this.link = link;
        this.title = title;
        this.img = img;
        this.location = location;
        this.text = text;
    }
}

class Detail {
    constructor(id, title, address, information, place){
        this.id = id;
        this.title = title;
        this.address = address;
        this.information = information;
        this.place = place;

    }
}

const app = new Vue({
    el: '#app',
    data: {
        search: '',
        select: 0,
        informationlist: [
            new Detail(
                1,//id  ภาคเหนือ
                "อุทยานประวัติศาสตร์กำแพงเพชร",//title
                "อุทยานประวัติศาสตร์กำแพงเพชร ตั้งอยู่ในเขตอำเภอเมืองทางฝั่งตะวันออกของแม่น้ำปิง มีพื้นที่ประมาณ 3.4 ตารางกิโลเมตร แบ่งออกเป็น 2 เขต คือ เขตภายในกำแพงเมือง พื้นที่ 503 ไร่ \
                และเขตนอกกำแพงเมืองหรือที่เรียกกันว่าเขตอรัญญิก พื้นที่ 1,611 ไร่ ตั้งอยู่บนเขาลูกรังขนาดย่อม โบราณสถานทั้ง 2 กลุ่ม ตั้งอยู่ในพื้นที่ตั้งของตัวจังหวัดกำแพงเพชร \
                ซึ่งอยู่ห่างจากกรุงเทพมหานครไปทางทิศเหนือ ประมาณ 358 กิโลเมตร กรมศิลปากรได้กำหนดเขตที่ดินโบราณสถานอุทยานประวัติศาสตร์กำแพงเพชร ประมาณ 2,114 ไร่",//Address
                "ในบริเวณที่ตั้งจังหวัดกำแพงเพชรปัจจุบันได้ค้นพบหลักฐานเมืองโบราณในลุ่มแม่น้ำปิง คือ เมืองแปบ เมืองเทพนคร เมือง ไตรตรึงษ์ เมืองพาน เมืองนครชุม และเมืองชากังราว เพราะความอุดมสมบูรณ์ของลุ่มน้ำปิง \
                ทำให้เกิดการตั้งบ้านเมืองทำมาหากิน ซึ่งแต่ละเมืองอยู่ไม่ห่างกันมากนัก เมืองที่ตั้งในยุคแรก ๆ น่าจะเป็นเมืองแปบที่มีตำนานเล่าว่าเป็นเมืองที่ตั้งอยู่ฝั่งนครชุม บริเวณ ตรงกันข้ามกับเมืองกำแพงเพชรในปัจจุบัน\
                 จากหลักฐานจารึกหลักที่ 3 (ศิลาจารึกนครชุม) พ.ศ. 1900 กล่าวถึงเหตุการณ์ที่ พระมหาธรรมราชาที่ 1 (ลิไท) เสด็จไป พระบรมธาตุ เมืองนครชุมว่า “หากเอาพระศรีรัตนมหาธาตุอันนี้มาสถาปนาในเมืองนครชุม” \
                 เมืองนครชุมน่าจะเป็นเมืองใหญ่และมี ความสำคัญในสมัยสุโขทัย แต่มาหมดอำนาจและเป็นเมืองเล็กๆ ในสมัยอยุธยา \
                 ส่วนเมืองชากังราวยังคงมีอำนาจอยู่ในฝั่งตะวันออก และเรียกชื่อเมืองว่า กำแพงเพชรในสมัยอยุธยา เพราะหลังจากพระมหาธรรมราชาลิไทสวรรคต (พ.ศ. 1913 – 1914) เมืองต่าง ๆ ในแคว้นสุโขทัยแตกแยก บางเมืองหันมาเป็นพันธมิตรกับอยุธยา \
                 ชื่อเมืองกำแพงเพชรปรากฏ ในศิลาจารึกหลักที่ 38 หรือจารึก กฎหมายลักษณะโจรกล่าวพระนามจักรพรรดิราชได้ขึ้นเสวยราชสมบัติที่เมืองกำแพงเพชร เมื่อ พ.ศ. 1940 เชื่อกันว่ากษัตริย์อยุธยา ต้องการให้ศูนย์กลางของอำนาจจากเมืองนครชุมเดิม \
                 ย้ายมาอยู่ที่เมืองชากังราวหรือกำแพงเพชรนั่นเอง และภายหลังการ เสียกรุงศรีอยุธยาครั้งที่ 2 พ.ศ. 2530 เมืองกำแพงเพชร ได้ลดบทบาทลงและคงจะร้างไปในที่สุด \
                 กลุ่มโบราณสถานเขตอรัญญิกของอุทยานประวัติศาสตร์กำแพงเพชร มีโบราณสถานรวมกลุ่มกันหนาแน่นในบริเวณที่ต่อเนื่อง เป็นผืนเดียวกัน ฃนอกจากนี้สภาพภูมิประเทศโดยรอบโบราณสถานยังเป็นป่าธรรมชาติที่มีการอนุรักษ์ไว้เป็นอย่างดี เพื่อคงไว้ซึ่ง บรรยากาศของโบราณสถานในเขตอรัญญิกหรืออรัญวาสีเช่นวันเวลาในอดีต\
                 อุทยานประวัติศาสตร์กำแพงเพชรได้รับการยกย่องให้เป็นมรดกโลกทางวัฒนธรรมในปี พ.ศ.2534 ร่วมกับอุทยานประวัติศาสตร์ สุโขทัย ศรีสัชนาลัย เนื่องจากหลักฐานที่ปรากฏแสดงให้เห็นถึงความงดงามอลังการของศิลปกรรมไทยในยุคแรกๆ ผลงานทาง ศิลปกรรมที่เป็นเลิศนี้ปรากฏอยู่เป็นจำนวนมากในอุทยานประวัติศาสตร์ทั้ง 3 แห่ง \
                 สมเด็จพระเทพรัตนราชสุดาฯ สยามบรมราชกุมารี เสด็จพระราชดำเนินเป็นองค์ประธานในพิธีเปิดอุทยานอย่างเป็นทางการเมื่อวันที่ 8 เมษายน พ.ศ.2534",//information
                "โบราณสถานภายในกำแพงเมืองสำรวจพบแล้วมีทั้งสิ้น 20 แห่ง ที่สำคัญ คือ วัดพระแก้ว วัดพระธาตุ วัดโบราณ หรือ สระมน ศาลพระอิศวร วัดกลางนคร เป็นต้น\
                 โบราณสถานนอกกำแพงเมืองโดยทั่วไปเรียกกันว่า “เขตอรัญญิก” ตั้งอยู่นอกกำแพงเมืองด้านทิศเหนือ มีพื้นที่ประมาณ 1,611 ไร่ ตั้งอยู่บนเขาลูกรังขนาดย่อม สำรวจพบโบราณสถานแล้ว 37 แห่ง \
                 ที่สำคัญคือ วัดพระนอน วัดพระสี่อิริยาบถ วัดช้างรอบ วัดอาวาสใหญ่ วัดฆ้องชัย วัดอาวาสน้อย วัดเชิงหวาย วัดดงหวาย วัดช้าง และวัดกะโลทัย เป็นต้น ส่วนโบราณสถานที่ตั้งอยู่ฟากตะวันตกของแม่น้ำปิง \
                 ทั้งภายในและภายนอกเมืองนครชุม ก็ยังมีกลุ่มโบราณสถานที่สำคัญตั้งอยู่ ภายใน เมืองนครชุมมีวัดพระบรมธาตุและวัดซุ้มกอ เป็นต้นส่วนที่อยู่นอกเมืองนครชุม ได้แก่ ป้อมทุ่งเศรษฐี วัดหนองพิกุล วัดหม่องกาเล และ วัดเจดีย์กลางทุ่ง เป็นต้น"//place
                ),
            new Detail(
                2,//id ภาคเหนือ
                "เมืองโบราณเวียงกาหลง",//Titile
                "สถานที่ตั้ง เมืองโบราณเวียงกาหลงตั้งอยู่บนเทือกเขาดอยดงในเทือกเขาดอยหลวง ในเขตบ้านป่าส้าน หมู่ที่ ๕ ตำบลหัวฝาย อำเภอเวียงป่าเป้า จังหวัดเชียงราย",//Address
                "เมืองโบราณเวียงกาหลงเป็นผังเมืองที่ไม่เป็นรูปทรงเรขาคณิตเช่นเดียวกับเมืองโบราณส่วนใหญ่ในภาคเหนือ ตัวเมืองตั้งอยู่บนเนินเขา มีกำแพงคันดินและคูเมืองล้อมรอบ แบ่งออกเป็นสองส่วนใหญ่ๆ คือ\
                ส่วนที่หนึ่ง เป็นรูปสี่เหลี่ยมเกือบจัตุรัสมุมมน มีคูเมืองอยู่ระหว่างกำแพงคันดินสองชั้น แบ่งพื้นที่ภายในเมืองออกเป็นหลายส่วน มีส่วนกำแพงคันดินถูกตัดขาดออกเป็นทางเดินหลายแห่งลักษณะคล้ายประตูเมือง\
                ส่วนที่สอง เป็นรูปรียาวต่อจากส่วนที่หนึ่งขึ้นไปทางทิศเหนือตามแนวเทือกเขา กำแพงคันดินสองชั้นขนาบคูเมืองอยู่ตรงกลางแนวกำแพงเมืองด้านตะวันออกขนานไปกับแนวสันเขาสูงชัน ด้านตะวันตกสร้างอยู่บนลาดเนินเขา \
                พื้นที่เมืองโบราณเวียงกาหลงมีทั้งหมดประมาณ ๔๓๐.๙๓๗๕ ไร่ คูเมืองและกำแพงคันดินโดยรอบยาว ๓,๓๕๐ เมตร",//Information
                "หลักฐานที่พบ คูเมืองและกำแพงคันดิน คูเมืองเมืองโบราณเวียงกาหลงขุดเป็นรูปคล้ายตัววี กว้างประมาณ ๑๘ เมตรลึก ๘.๘๐ เมตร กำแพงเมืองเป็นคันดินที่เกิดจากการขุดคูเมืองตรงกลางขึ้นมาถมทั้งสองข้าง \
                กำแพงเมืองชั้นในสูงกว่าด้านนอก ไม่พบว่ามีการใช้วัสดุอื่นมาช่วยเสริมความมั่นคงแข็งแรงของกำแพงเมืองเลยในการสำรวจและขุดค้นในแหล่งโบราณคดีเมืองโบราณเวียงกาหลง พบโบราณวัตถุต่างๆ \
                มากมายจำแนกเป็นโบราณวัตถุที่เป็นสิ่งประดิษฐ์ (Finds) เช่น เศษภาชนะดินเผา เศษกระเบื้องดินเผา อิฐ เบี้ยดินเผาดินเผาไฟ เครื่องมือเหล็ก หินลับมีด เป็นต้น \
                และโบราณวัตถุที่ไม่เป็นสิ่งประดิษฐ์ (Non Finds) เช่น ถ่านไม้กระดูกสัตว์ ดินเผาไฟ ขี้แร่ เป็นต้น"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                3,//ภาคเหนือ
                "เจดีย์คู่",//Title
                "ตั้งอยู่เชิงสะพานกิตติขจรฝั่งตะวันตก ในบริเวณวัดสมเด็จพระนารายณ์มหาราช ตำบลแม่ท้อ อำเภอเมือง จังหวัดตาก",//Address
                "สมเด็จกรมพระยาดำรงราชานุภาพสันนิษฐานว่า เจดีย์คู่นี้สร้างไว้แต่ครั้งสมเด็จพระนเรศวรมหาราชกับสมเด็จพระเอกาทศรถ เมื่อคราวตีได้เมืองเชียงใหม่กลับคืนมาเป็นของไทย \
                ทรงสร้างขึ้นเพื่อเป็นอนุสรณ์ครั้งกระนั้น ต่อมาของเดิมคงจะชำรุดทรุดโทรมลง สมเด็จพระนารายณ์มหาราชจึงโปรดให้บูรณะขึ้นใหม่ ลักษณะทั่วไป\
                จะเป็นเจดีย์คู่กัน ๒ องค์ ที่กำแพงและฐานเจดีย์ทำเป็นช่องสำหรับตามประทีปโดยรอบ",//Information
                "หลักฐานที่พบ เจดีย์คู่ ๒ องค์นี้ เป็นฝีมือช่างอยุธยา ที่ฐานเจดีย์มีช่องสำหรับตามประทีปโดยรอบ เป็นหลักฐานว่าน่าจะเป็นของที่สร้างหรือปฏิสังขรณ์แต่ครั้งแผ่นดินสมเด็จพระนารายณ์มหาราช เพราะช่องตามประทีปซึ่งทำไว้ตามกำแพงและฐานเจดีย์นั้นเป็นของที่นิยมสร้างในสมัยแผ่นดินสมเด็จพระนารายณ์มหาราช",//Place เป็นหลักฐานที่พบ

            ),
            new Detail(
                4,//ภาคเหนือ
                "วัดสมเด็จพระนารายณ์มหาราช",//Title
                "ตั้งอยู่เชิงสะพานกิตติขจรฝั่งตะวันตกในตัวเมืองจังหวัดตาก ตำบลแม่ท้อ อำเภอเมือง จังหวัดตาก",//Address
                "สมเด็จฯ กรมพระยาดำรงราชานุภาพ เมื่อเสด็จมาถึงเนินเขาแก้วในคราวล่องแก่งแม่น้ำปิงใน พ.ศ. ๒๔๖๔ ได้เสด็จขึ้นไปตรวจวัดนี้ ทรงพบช่องตามประทีปที่กำแพงรอบอุโบสถ จึงทรงสันนิษฐานว่า \
                สมเด็จพระนารายณ์มหาราชน่าจะทรงโปรดให้สร้างเฉลิมพระเกียรติพระองค์ที่ทรงตีเมืองเชียงใหม่ได้ หลังเสด็จกลับจากเมืองเชียงใหม่ใน พ.ศ. ๒๒๐๕ วัดสมเด็จพระนารายณ์มหาราช ตั้งอยู่บนเนินเขาแก้ว \
                ใต้วัดดอยข่อยเขาแก้วลงไปประมาณ ๑,๒๐๐ เมตร มีพระอุโบสถ ซึ่งผูกพัทธสีมาสองชั้น มีกำแพงแก้วรอบพระอุโบสถ ทางกำแพงด้านในทำเป็นช่องเล็ก ๆ สำหรับตามประทีปรอบอุโบสถ ทั้ง ๔ ด้าน",//Information
                "หลักกฐานที่พบ ซากพระอุโบสถ และช่องตามประทีปทางกำแพงด้านในทั้ง ๔ ด้าน เหมือนที่พระนารายณ์ราชนิเวศน์ จังหวัดลพบุรี และรูปทรงลักษณะของพระอุโบสถและกำแพงแก้วที่ยังเหลืออยู่ เป็นฝีมือช่างสมัยกรุงศรีอยุธยาเช่นกัน"//Place เป็นลักฐานที่พบ
            ),
            new Detail(
                5,//ภาคตะวันออกเฉียงเหนือ
                "แหล่งโบราณคดีโนนเมือง",//Title
                "ตั้งอยู่ที่บ้านโนนเมือง อำเภอชุมแพ จังหวัดขอนแก่น",//Address
                "จากการสำรวจและขุดค้นโดยหน่วยศิลปากรที่ ๗ จังหวัดขอนแก่น เมื่อ พ.ศ ๒๕๒๕-๒๕๒๖ พบว่าบ้านโนนเมืองมีความเก่าแก่ถึง ๓ ช่วงสมัยติดต่อกัน คือ สมัยก่อนประวัติศาสตร์ตอนปลายอายุราว ๓,๐๐๐ ปี \
                สมัยประวัติศาสตร์ตอนต้นเรียกว่าสมัยทวาราวดี ราวพุทธศตวรรษที่ ๑๓-๑๖ และสมัยประวัติศาสตร์เรียกว่า ลพบุรี ราวพุทธศตวรรษที่ ๑๖-๑๙ มีคูน้ำและคันดินรูปกลมรี เป็นแหล่งพิพิธภัณฑ์กลางแจ้งมีหลุมขุดค้นสาธิตขนาดใหญ่ ๗ หลุม",//Information
                "ใบเสมาหินทรายกระจายอยู่ทั่วไป คูเมืองขนาดใหญ่แสดงให้เห็นชุมชนซึ่งเป็นศูนย์กลาง และชุมชนย่อยกระจายอยู่โดยรอบ ซึ่งเป็นที่อยู่อาศัยของคนสมัยก่อนประวัติศาสตร์และสมัยประวัติศาสตร์ \
                มีโครงกระดูกมนุษย์โบราณฝังอยู่เป็นระเบียบและสมบูรณ์ มีเครื่องใช้ กำไลมือ กำไลเท้าที่อุทิศให้แก่ศพ และเครื่องปั้นดินเผาแบบต่าง ๆ มีใบเสมาสมัยทวาราวดีเป็นจำนวนมาก หนึ่งในนั้นได้นำไปทำเป็นเสาหลักเมืองของเทศบาลนครขอนแก่น"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                6,//ภาคตะวันออกเฉียงเหนือ
                "เมืองฟ้าแดดสงยาง",//Title
                "บ้านก้อม ตำบลหนองแปน อำเภอกมลาไสย จังหวัดกาฬสินธุ์",//Address
                "เมืองฟ้าแดดสงยาง เป็นเมืองในยุคโบราณ สร้างขึ้นในราวพุทธศตวรรษที่ ๑๒-๑๖ ประมาณ ๑,๔๐๐ ปีล่วงมาแล้ว มีชื่อเรียกหลายชื่อ เช่น คนพื้นเมืองเรียก ฟ้าแดดสูงยาง \
                ในบทวรรณกรรมท้องถิ่นเรียก ฟ้าแดดสงยาง เรียกตามชื่อบ้านเรียก บ้านเสมา ตามประวัติศาสตร์สมัยพระเจ้าฟ้างุ้ม แห่งกรุงศรีสัตนาคนหุต เรียก โนนผึ่งแดดหรือโพนผึ่งแดด เป็นต้น \
                เมืองฟ้าแดดสงยาง มีพื้นที่ประมาณ ๓๐๐-๕๐๐ ไร่ แผนผังเมืองเป็น วงรีมี มีคันดินล้อมรอบเป็นคูเมืองสองชั้นวัดโดยรอบมีความยาวประมาณ ๕ กิโลเมตร ขนาดผังเมืองยาว ๒,๐๐๐ เมตร \
                กว้างประมาณ ๑,๓๕๐ เมตร ส่วนประตูเมืองไม่ทราบแน่ชัดแต่สันนิษฐานว่าอยู่ตรงคูเมืองทั้ง ๔ ทิศ ภายในบริเวณเมืองเก่ามีร่องรอยโบราณสถานอยู่หลายแห่ง",//Information
                "หลักฐานที่พบ ร่องรอยของศาสนสถาน ๑๔ แห่ง ลักษณะของแผนผังศาสนสถานที่สร้างขึ้นตามคติในพุทธศาสนา เป็นศิลปกรรมแบบทวารวดี พระธาตุยาคู ใบเสมาหินทรายสีแดง ที่มีทั้งเป็นแท่งหินกลม \
                เหลี่ยมและแผ่นศิลา ทั้งแบบแผ่นหินทรายเกลี้ยง แผ่นหินทรายสลักลวดลาย และมีจารึกตัวอักษรโบราณ ที่พบส่วนใหญ่ไม่มีลวดลาย ส่วนแผ่นที่มีลวดลายมักเป็นเสมารูปกลีบบัว จำหลักเป็นลายสถูปแบบทวารวดี \
                ภาพสำคัญคือภาพจำหลักเรื่องราวพุทธประวัติ และมหานิบาติชาดกที่งดงามมาก ทำให้ทราบถึงคติความเชื่อความนิยม รวมถึงการแต่งกายและสถาปัตยกรรมเครื่องไม้ในสมัยนั้น \
                เมืองฟ้าแดดสงยางจึงนับเป็นแหล่งเสมาหินใหญ่และสำคัญที่สุดในภาคตะวันออกเฉียงเหนืออีกด้วย ซึ่งใบเสมาในจำนวนนี้กว่า ๑๓๐ แผ่น ที่กรมศิลปากรขึ้นทะเบียนไว้ \
                ได้ถูกเคลื่อนย้ายไปเก็บรักษาไว้ที่ พิพิธภัณฑสถานแห่งชาติ จังหวัดขอนแก่น นอกจากนี้ยังพบพระพิมพ์ดินเผา เป็นงานอิทธิพลสกุลช่างฝีมือคุปตะ รุ่นหลัง อายุราว ๑,๐๐๐-๒,๐๐๐ ปี \
                ลูกปัด เครื่องประดับ เครื่องปั้นดินเผา กล้องยาสูบดินเผาลวดลายอมราวดีก้านขดเป็นรูปตัวมังกร อายุ ๗,๐๐๐ ปี และที่น่าสนใจคือ กล้องยาสูบชนิดเดียวกันแต่ทำด้วยทองสัมฤทธิ์ อายุ ๕,๐๐๐-๖,๐๐๐ ปี \
                เป็นเครื่องยืนยันว่ายุคโลหะของสุวรรณภูมิได้เริ่มขึ้นในบริเวณนี้ก่อนทุกๆ ที่ในโลก นอกจากนี้ยังพบโครงกระดูกมนุษย์ปะปนอยู่ในหลุมขุดภายในบริเวณเมืองโบราณนี้ด้วย"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                7,//ภาคตะวันออกเฉียงเหนือ
                "พระธาตุยาคู",//Title
                "บ้านเสมา อำเภอกมลาไสย จังหวัดกาฬสินธุ์",//Address
                "เจดีย์ทรง ๘ เหลี่ยม ใบเสมาหินทราย จากการตรวจสอบหลักฐานสันนิษฐานว่าสร้างในสมัยทวารวดี ต่อมาคงปรักหักพังไปตามกาลเวลาและเพราะขาดการดูแลเอาใจใส่ ต่อมาในสมัยกรุงศรีอยุธยา \
                คงสร้างเจดีย์ทรงแปดเหลี่ยม ก่ออิฐถือปูนซ้อนทับฐานเดิมและในสมัยกรุงรัตนโกสินทร์คงมีการสร้างต่อเติมส่วนยอดให้สูงขึ้นอีก จนกระทั่งถึง พ.ศ.๒๕๑๐-๒๕๒๒ กรมศิลปากรได้ทำการขุดแต่งและบูรณะ\
                เจดีย์องค์นี้ รวมทั้งได้จดทะเบียนเป็นโบราณสถานพระธาตุยาคูนี้ชาวบ้านเชื่อกันว่า เป็นเจดีย์ที่บรรจุอัฐิของพระเถระชั้นผู้ใหญ่ ที่ชาวเมืองเคารพนับถือ จึงจัดให้มีเทศกาลบูชาพระธาตุประจำปี \
                ระหว่างเดือนเมษายนถึงเดือนพฤษภาคม เพื่อขอฝนและความสงบร่มเย็นแก่หมู่บ้านลักษณะทั่วไปเป็นพระธาตุเจดีย์ขนาดใหญ่ที่สุดในบริเวณเมืองฟ้าแดดสงยาง \
                ก่อด้วยอิฐดินเป็นเจดีย์ทรง ๘ เหลี่ยมย่อมุมไม้ ๑๒ มีขนาดฐานกว้าง ๑๐ เมตร ยาว ๑๐ เมตร สร้างซ้อนกันในลักษณะเป็นจตุรมุข มีบันไดทางขึ้น ๔ ทิศ ความสูงวัดจากฐานถึงยอดสูง ๘ เมตร",//Information
                "หลักฐานที่พบ จดีย์ทรง ๘ เหลี่ยม ใบเสมาหินทราย"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                8,//ภาคตะวันออกเฉียงเหนือ
                "ปรางค์กู่",//Title
                "ตั้งอยู่ที่บ้านหนองบัว ตำบลในเมือง เขตอำเภอเมือง อยู่ห่างจากตัวจังหวัดประมาณ ๓ กิโลเมตร",//Address
                "ปรางค์กู่ เป็นอโรคยาศาลสร้างขึ้นสมัยพระเจ้าชัยวรมันที่ ๗ ระหว่าง พ.ศ. ๑๗๒๔-๑๗๖๓ หรือพุทธศตวรรษที่ ๑๘ มีข้อความว่าให้อยู่ใต้พระบารมีของพระพุทธเจ้า ผู้ทรงการแพทย์คือ \
                พระไภษัชยคุรุไวทูรยประภา ผู้ประทานความสุขเกษมและความไม่มีโรคให้แก่ประชาชน ปัจจุบันเป็นโบราณสถานที่สำคัญและมีสภาพสมบูรณ์ที่สุดแห่งหนึ่งในจังหวัดชัยภูมิ ปรางค์กู่เป็นปราสาทอีกแห่งหนึ่ง \
                ที่มีแผนผังและลักษณะเช่นเดียวกับปราสาทที่ได้พบหลักฐานว่าเป็นอโรคยาศาล ที่สร้างขึ้นในพุทธศตวรรษที่ ๑๘ นั่นคือ มีปรางค์ประธานอยู่ตรงกลาง ๑ องค์ วิหารหรือบรรณาลัยด้านหน้า ๑ หลัง \
                ล้อมรอบด้วยกำแพงซึ่งมีโคปุระเฉพาะด้านหน้าทั้งหมด ก่อด้วยศิลาแลงยกเว้นกรอบประตูหน้าต่าง ทับหลัง เสาประดับเป็นหินทราย หันหน้าไปทางทิศตะวันออก \
                นอกกำแพงตรงมุมทิศตะวันออกเฉียงเหนือมีสระน้ำ ๑ สระ ยังคงสภาพสมบูรณ์ดีมาก โดยเฉพาะปรางค์ประธานซึ่งมีผังเป็นรูปสี่เหลี่ยมจัตุรัสขนาด ๕ เมตร ย่อมุมไม้สิบสอง \
                ด้านหน้ามีประตูเข้าออกทำเป็นมุขยื่นออกมา ผนังปรางค์อีก ๓ ด้านเป็นประตูหลอก เหนือประตูหลอกด้านทิศเหนือยังคงมีทับหลังติดอยู่ จำหลักภาพตรงกลางเป็นพระพุทธรูปประทับนั่งปางสมาธิเหนือหน้ากาล \
                ซึ่งจับท่อนพวงมาลัยไว้ด้วยมือทั้งสองข้าง ด้านข้างทางซ้ายและขวาจำหลักรูปพระโพธิสัตว์อวโลกิเตศวร ๔ กร กับรูปนางปรัชญาปารมิตา ด้านหน้ามีทับหลังเช่นกัน \
                สันนิษฐานว่าสลักเป็นภาพเดียวกัน แต่ปัจจุบันลบเลือนมาก ที่ช่องประตูหลอกด้านทิศเหนือยังมีพระพุทธรูปศิลาปางสมาธิ ศิลปะแบบทวาราวดี ขนาดสูง ๑.๗๕ เมตร หน้าตักกว้าง ๗.๕ เมตร \
                ประดิษฐานอยู่ ๑ องค์ ซึ่งเป็นของที่เคลื่อนย้ายมาจากที่อื่น นอกจากนี้ยังพบทับหลังและองค์ประกอบสถาปัตยกรรมอื่น ๆ เช่น เสาประดับประตู",//Information
                "นอกกำแพงตรงมุมทิศตะวันออกเฉียงเหนือมีสระน้ำ ๑ สระ ยังคงสภาพสมบูรณ์ดีมาก โดยเฉพาะปรางค์ประธานซึ่งมีผังเป็นรูปสี่เหลี่ยมจตุรัส ขนาด ๕ เมตร \
                ย่อมุมไม้สิบสองด้านหน้ามีประตูเข้าออกทำเป็นมุขยื่นออกมา ผนังปรางค์มี ๓ ด้าน เป็นประตูหลอก เหนือประตูหลอกด้านทิศเหนือยังมีทับหลังติดอยู่ \
                จำหลักภาพตรงกลางเป็นพระพุทธรูปประทับนั่งปางสมาธิเหนือกาล ซึ่อถือพวงมาลัยไว้ด้วยมือทั้งสองข้าง ด้านข้างทางซ้ายและขวาจำหลักรูปพระโพธิสัตว์อวโลกิเตศวร ๔ กร \
                กับรูปนางปรัชญาปารมิตาด้านหน้ามีทับหลังเช่นกัน สันนิษฐานว่าสลักเป็นภาพเดียวกัน แต่ปัจจุบันลบเลือนมากที่ช่องประตูหลอกด้านทิศเหนือยังมีพระพุทธรูปศิลาปางสมาธิ \
                ศิลปะแบบทวาราวดี ขนาดสูง ๑.๗๕ เมตร หน้าตักกว้าง ๗.๕ เมตร ประดิษฐานอยู่ ๑ องค์ ซึ่งเป็นของที่เคลื่อนย้ายมาจากที่อื่นนอกจากนี้ยังพบทับหลังและองค์ประกอบสถาปัตยกรรมอื่นๆ \
                เช่น เสาประดับประตู"//Place เป็นหลักฐานที่พบ
                ),
            new Detail(
                9,//ภาคกลาง
                "ปราสาทเมืองสิงห์",//Title
                "ตำบลสิงห์ อำเภอไทรโยค จังหวัดกาญจนบุรี",//Address
                "เป็นเมืองที่สร้างขึ้นตั้งแต่ขอมมีอำนาจ ประมาณ พ.ศ. ๑๔๐๐ - ๑๗๐๐ ครั้นเมื่อขอมหมดอำนาจและไทยได้เข้ามาครอบครองดินแดนแถบนี้แทน ในสมัยกรุงศรีอยุธยา \
                คงเห็นว่าเมืองสิงห์เป็นเมืองเล็กไม่มีความสำคัญจึงมิได้แต่งตั้งผู้ใดมาเป็นเจ้าเมือง คงปล่อยให้ร้างไปหลังจากขอมหมดอำนาจลง เมื่อถึงรัชสมัยพระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลก \
                จึงได้ทรงตั้งเมืองสิงห์ขึ้นใหม่อีกครั้ง และแต่งตั้งเจ้าเมืองมาครองในฐานะเป็นเมืองหน้าด่านขึ้นอยู่กับจังหวัดกาญจนบุรี เมืองสิงห์คงมีสภาพเป็นเมืองมาจนถึงสมัยพระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว \
                จึงได้เปลี่ยนแปลงการปกครองใหม่โดยจัดให้เป็นแบบมณฑลเทศาภิบาล เมืองสิงห์ จึงถูกยุบลงกลายเป็นตำบล ขึ้นอยู่กับอำเภอไทรโยคมาจนปัจจุบัน",//Information
                "จากการขุดแต่งบริเวณปราสาทเมืองสิงห์ โดยเจ้าหน้าที่กองโบราณคดี ได้พบประติมากรรมศิลปะขอมแบบบายนในพุทธศาสนาลัทธิมหายานที่สำคัญหลายชิ้น \
                ได้แก่ ประติมากรรมรูปพระโพธิสัตว์อวโลกิเตศวร นางปรัชญาปารมิตา และชิ้นส่วนของพระพุทธรูป เป็นต้น"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                10,//ภาคกลาง
                "โบราณสถานเมืองเพนียด",//Title
                "สถานที่ตั้ง หมู่ที่ ๔ ตำบลคลองนารายณ์ อำเภอเมือง จังหวัดจันทบุรี",//Address
                "เพนียด เป็นชุมชนโบราณ ที่พบหลักฐานทางโบราณคดี ประวัติศาสตร์ที่สำคัญจากจารึกภาษาขอม อายุราว พ.ศ. ๘๐๐-๑๐๐๐ ได้กล่าวว่า บริเวณที่ตั้งโบราณสถานเพนียดนั้น \
                เดิมเป็นที่ตั้งเมืองจันทบุรีในยุคแรก ซึ่งขอมถือเป็นแหล่งอารยธรรมที่สำคัญเมืองหนึ่งของอาณาจักรกัมพูชา โดยมีเจ้าผู้ครองนครทำการปกครองอย่างเป็นอิสระ \
                ได้มีการติดต่อกับอินเดียและรับเอาวัฒนธรรมของอินเดียเข้ามาใช้ในวิถีชีวิต เนื่องจากเป็นบริเวณที่มีเรือสำเภาผ่านไปมาค้าขายกับจีน และอินเดีย ดังนั้นชาวพื้นเมืองก็คือชาวชองและชาวขอม",//Information
                "หลักฐานที่พบ ๑. พบจารึกเพนียด ๑ ขนาดกว้าง ๔๙ ซม. สูง ๔๗ ซม. หนา ๑๖.๕ ซม. ทำด้วยศิลาทราย จารึกด้วยอักษรขอมโบราณ ภาษาสันสกฤตและเขมร \
                ปัจจุบันอยู่ที่หอพระสมุดวชิรญาณ กองหอสมุดแห่งชาติ กรุงเทพมหานคร๒. โบราณวัตถุ เป็นหินแกะสลัก เป็นรูปและลวดลายต่าง ๆ เช่น ราหูอมจันทร์ เทวรูปหรือรามสูรย์ และเศษถ้วยชามต่าง ๆ \
                ปัจจุบันเก็บไว้ที่วัดทองทั่ว"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                11,//ภาคกลาง
                "เขาโต๊ะโมะ",//Title
                "บ้านอีเร็ม ตำบลประณีต อำเภอเขาสมิง จังหวัดตราด",//Address
                "คำว่า โต๊ะโมะ เป็นภาษาชอง แปลว่า ฉางที่เก็บของ ภาษาเขมรต่ำ แปลว่า ภูเขาหรือเนินสูง กรมศิลปากร สันนิษฐานว่า โบราณสถานเขาโต๊ะโมะ \
                เป็นซากโบราณสถานที่เก่าแก่และใหญ่โต ระบุไม่ได้ว่าเป็นสมัยใด ได้ประกาศขึ้นทะเบียนเป็นโบราณสถาน เมื่อ ๓๑ สิงหาคม พ.ศ.๒๕๓๑ คณะสิ่งแวดล้อมและทรัพยากรศาสตร์ มหาวิทยาลัยมหิดล \
                สันนิษฐานว่าแท่งหินเหล่านี้เกิดจากการแทรกดันตัวของหินอัคนี เรียกว่า หินบะซอลท์จากคำบอกเล่าเชื่อว่าคงมีการนำแท่งหินจากบ่อขุมทรัพย์ซึ่งอยู่บริเวณใกล้เคียงกับโบราณสถาน \
                มาเรียงกันเพื่อทำเทวสถานไว้เป็นเครื่องสักการะบูชา สังเกตได้จากการปลูกต้นโศกไว้รอบ ๆ เทวสถาน",//Information
                "หลักฐานที่พบ บริเวณพื้นที่รอบ ๆ โบราณสถานประมาณ ๕ กิโลเมตร ชาวบ้านพบวัตถุโบราณสมัยก่อนประวัติศาสตร์ เป็นเครื่องมือ เครื่องใช้ประเภทหินขัด เครื่องปั้นดินเผา \
                เครื่องบดยาหิน พระพุทธรูปเก่าแก่ จากหลักฐานที่พบแสดงให้เห็นว่าบริเวณนี้อาจเป็นที่ตั้งของชุมชนโบราณ หรืออาจเป็นการอพยพเร่ร่อนของชนเผ่าดั้งเดิมที่อพยพเคลื่อนย้ายมาอยู่ในแถบนี้"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                12,// ภาคกลาง
                "เขาดิน",//Title
                "สถานที่ตั้ง อำเภอบางปะกง จังหวัดฉะเชิงเทรา",//Address
                "เขาดินมีลักษณะเป็นเนินหินแกรนิตที่เป็นหินชนิดเดียวกับหินที่ราบบริเวณเขาสามมุข จังหวัดชลบุรี มีความสูงจากพื้นที่ราบรอบบริเวณเขาดินประมาณ ๑๕ เมตร \
                ตั้งอยู่โดดเดี่ยวล้อมรอบด้วยทุ่งนาและป่าจาก บนยอดเขาซึ่งมีต้นไม้ขนาดเล็กขึ้นอยู่นั้นเป็นที่ตั้งของ วัดเขาดิน หรือ วัดปถวีบัพตาราม \
                นับว่าเป็นแหล่งโบราณคดีบนเนินหินและเป็นสถานที่ท่องเที่ยวแห่งเดียวของอำเภอบางปะกง ที่มีความสูงกว่าที่แหล่งอื่น",//Information
                "หลักฐานที่พบภายในวัดมีมณฑปร้างเหลือแต่อิฐสีเทาอยู่หลังหนึ่ง สันนิษฐานว่าเป็นที่ประดิษฐานรอยพระพุทธบาทจำลอง พระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัว \
                เคยเสด็จประพาสตอนขากลับจากเสด็จฯ ชายทะเลตะวันตก เมื่อ พ.ศ.๒๔๐๑"//Place เป็นสถานที่พบ
            ),
            new Detail(
                13,//ภ่าคใต้
                "แหล่งโบราณคดีถํ้าเสือ",//Title
                "บ้านถํ้าเสือ ตำบลกระบี่น้อย อำเภอเมือง จังหวัดกระบี่",//Address
                "สมัยที่บริเวณนี้ยังเป็นป่ารก ชาวบ้านได้พบเห็นเสือโคร่งเดินเข้าออกแถบถํ้านี้อยู่เสมอจึงเรียกกันว่า ถํ้าเสือ และเป็นชื่อหมู่บ้านนี้ด้วย เมื่อพระอาจารย์ จำเนียร สีลเสฏโฐ มาบุกเบิกใหม่ๆ \
                ได้เล่าว่า สภาพเดิมเป็นป่ารกมาก มีถํ้าที่สงบเงียบเหมาะแก่การทำวิปัสนากรรมฐาน ได้พบคนแปลกหน้าคนหนึ่งในหุบเขาคีรีวง ท่านได้ถามว่าในถํ้านี้เป็นอย่างไรบ้าง \
                ชายผู้นั้นตอบว่าขอให้ท่านขึ้นไปขี่บนหลังของเขาเถอะแล้วจะพาเข้าไปดูในถํ้าและบอกว่ามีทรัพย์สมบัติมากมาย แต่ท่านก็มิได้ไปเพราะคิดว่าคนผู้นี้จะอาศัยท่านเข้าไปเอาวัตถุมีค่าในถํ้าเสียมากกว่า \
                ต่อมาเมื่อท่านนำพระและเณรมาอยู่แล้วก็พบชายผู้นี้อีกครั้งหนึ่งในหุบเขา ชายผู้นั้นได้บอกเล่าเรื่องราวต่างๆอีกมากมาย โดยเล่าว่า เมื่อประมาณ ๑๒๐๐ ปีมาแล้ว หุบเขาถํ้าเสือเป็น\
                เกาะใกล้ทะเล ครั้งหนึ่งมีชาวเมืองไทรบุรีได้ทราบข่าวการสร้างพระธาตุเมืองนครศรีธรรมราช จึงพากันนำเอาทรัพย์สินเงินทองจะมาบรรจุไว้ในพระธาตุ \
                เรือถูกพายุมาติดที่บริเวณถํ้าเสือเป็นเวลาช้านาน ผู้คนเหล่านั้นต่างล้มตายไปหลายคน ต่อมาได้ทราบว่าการสร้างพระบรมธาตุนั้นเสร็จสิ้นแล้ว พวกที่เหลือจึงเอาทรัพย์สินสมบัติฝังไว้ในถํ้า \
                ช่วยสกัดก้อนหินปากถํ้าเอาไว้ โดยอาศัยระบบนํ้าย้อยจนปากถํ้าปิดสนิทต่อมาอีกหลายร้อยปีทะเลบริเวณนี้ \
                ได้ตื้นเขินกลายเป็นป่าเสน ผู้คนได้อพยพเข้ามาตั้งหลักแหล่งที่อยู่อาศัย กลายเป็นที่พักของพวกพ่อค้าเดินทางไปมา หรือข้ามแหลมจากตะวันตกไปยังตะวันออก \
                พระอาจารย์จำเนียร สีลเสฏโฐ กล่าวว่าชายคนนี้เล่าเหมือนว่าเขารู้ประวัติศาสตร์ดีแต่จะเชื่อได้แค่ไหนขอให้พิจารณาดู หลังจากนั้นท่านก็บอกว่าไม่พบเห็นชายผู้นั้นอีกเลย \
                จึงคิดว่าเขาคงเป็นเจ้าของทรัพย์สมบัติภายในถํ้าแห่งนี้ จึงให้ชื่อว่าถํ้าคนธรรพ์ บริเวณนี้เคยมีคนเคยพบพระพุทธรูปทองคำและวัตถุมีค่าอื่นๆอีกด้วย \
                ที่ใกล้เคียงกันมีการคนพบถํ้าเล็กถํ้าน้อยอีกมากมาย เช่น ถํ้าปลาไหล ถํ้าลูกธนู ถํ้าช้างแก้วเป็นต้น",//informaiton
                "จากการสำรวจทางโบราณคดีของนักโบราณคดี มีการค้นพบหลักฐานทางโบราณคดีที่สำคัญในแหล่งโบราณคดีแห่งนี้ คือ เครื่องมือหิน พระพิมพ์ดินดิบ ภาชนะดินเผาทรงกลมมีการตกแต่งลวดลายเชือกทาบและเศษภาชนะดินเผา รวมทั้งภาชนะดินเผาประเภทหม้อสามขา\
                โบราณวัตถุที่พบพระอาจารย์จำเนียร สีลเสฏโฐ ประธานสงฆ์สำนักถํ้าเสือเป็นผู้เก็บรักษาไว้ที่วัดถํ้าเสือเป็นจำนวนมาก และในบางส่วนอยู่ในความครอบครองของชาวบ้าน"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                14,//ภาคใต้
                "ถํ้าอ่าวปากหมาก",//Title
                "สถานที่ตั้ง หมู่ที่ ๒ บ้านนาเขาไฟไหม้ ตำบลทับปริก อำเภอเมือง จังหวัดกระบี่",//Address
                "พระมหาอิทธิพล สุพโล และประชาชนในพื้นที่ได้ทำการขุดดินภายในถํ้าอ่าวปากหมาก เพื่อปรับสภาพพื้นที่สร้างศาลาที่พักสงฆ์บริเวณหน้าถํ้า และพบชิ้นส่วนของโครงกระดูกมนุษย์ประมาณ ๑๐ โครง \
                พร้อมทั้งเครื่องมือเครื่องใช้สมัยหิน ประเภทขวานหิน ภาชนะดินเผาลายเชือกทาบ เครื่องประดับหิน และซากสัตว์ แต่ชิ้นส่วนของโครงกระดูกได้ถูกเผาไปหมดแล้ว สำหรับเครื่องมือเครื่องใช้ \
                ทางสำนักงานศึกษาธิการอำเภอเมืองกระบี่ ได้นำไปเก็บรักษาไว้เพื่อรอการศึกษาวิเคราะห์จากนักโบราณคดีต่อไป",//Information
                "ซากโครงกระดูกมนุษย์สมัยก่อนประวัติศาสตร์ เครื่องมือหิน ภาชนะดินเผาลายเชือกทาบ ชิ้นส่วนกระดูกสัตว์"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                15,//ภาคใต้
                "แหล่งโบราณคดีถํ้าหมอเขียว",//Title
                "บ้านหน้าชิง ตำบลกระบี่น้อย อำเภอเมือง จังหวัดกระบี่",//Address
                "จากคำบอกเล่าของชาวบ้านในท้องถิ่นที่มีการเรียกว่าถํ้าหมอเขียว ในอดีตมีหมอพื้นบ้านคนหนึ่งมีชื่อว่าหมอเขียว ซึ่งมีความรู้เกี่ยวกับสมุนไพรเป็นอย่างดีจนชาวบ้านเลื่อมใสและรู้จักกันดีในละแวกหมู่บ้านหน้าชิง อยู่อาศัยในถํ้าหมอเขียวเมื่อหมอเขียวเสียชีวิตลงชาวบ้านก็เรียกชื่อถํ้าที่หมอเขียวอยู่ว่าถํ้าหมอเขียว\
                โครงการวิจัยวัฒนธรรมโฮบิเนียนในประเทศไทย (The Hoabinhian Research Project in Thailand) ซึ่งเป็นโครงการศึกษาชาติพันธุ์วิทยาทางโบราณคดี ได้สำรวจพบหลักฐานบนพื้นผิวดินและระบุเป็นครั้งแรกว่า \
                ถํ้าหมอเขียวเป็นแหล่งโบราณคดีสมัยก่อนประวัติศาสตร์เมื่อปี พ.ศ ๒๕๓๔ และได้ดำเนินการขุดค้นทางโบราณคดีที่ถํ้าแห่งนี้ในปีเดียวกัน คณะผู้ดำเนินการขุดค้นและวิเคราะห์ข้อมูลด้านต่างๆที่ได้จากการขุดค้น \
                ประกอบด้วยศาสตราจารย์ ดร.สุรินทร์ ภู่ขจร อาจารย์คณะโบราณคดี มหาวิทยาศิลปากร หัวหน้าอำนวยการขุดค้น วิเคราะห์สภาพแหล่งและผลการขุดค้นตามชั้นดินวัฒนธรรม นายประพิศ ชูศิริ \
                นักโบราณคดีจากกองโบราณคดี กรมศิลปากร วิเคราะห์เรื่องโรคจากโครงกระดูกมนุษย์ นางเยาวลักษณ์ ชัยมณี วิเคราะห์กระดูกสัตว์ นายอำพล ไวศยดำรง วิเคราะห์หอย และนายมนัส วัฒนศักดิ์ \
                วิเคราะห์ละอองเกสรพืช",//Information
                "นักโบราณคดีได้ทำการสำรวจขุดค้นทางโบราณคดี เมื่อปี พ.ศ ๒๕๓๔ ได้แบ่งชั้นดินออกเป็น ๖ ชั้น จากชั้นบนลงไปชั้นล่างพบหลักฐานต่างๆดังนี้\
                - เศษภาชนะดินเผาเนื้อหยาบสีเทาเข้มและสีดำมีทั้งผิวเรียบและลายเชือกทาบ\
                - เครื่องมือหินและเครื่องมือกระดูก มักเป็นเครื่องมือหินขัดกระเทาะ เครื่องมือสะเก็ดหินและมีเครื่องมือกระดูกบ้างบางส่วน\
                - กระดูกสัตว์ ได้แก่กระดูกสัตว์ใหญ่และเปลือกหอยชนิดต่างๆ ทั้งหอยทะเลและหอยนํ้าจืด\
                - หลักฐานเกี่ยวกับเมล็ดพืช\
                - หลักฐานเกี่ยวกับกองไฟในชั้นวัฒนธรรมต่างๆ มักพบร่วมกับกระดูกสัตว์ เมล็ดพืช ขวานหิน และสะเก็ดหิน\
                - เครื่องประดับ ลูกปัดทำจากเปลือกหอย กระดูกสัตว์และแผ่นหิน\
                - หลุมฝังศพและโครงกระดูก"//Place เป็นหลักฐานที่พบ
            ),
            new Detail(
                16,//ภาคใต้
                "ชุมชนโบราณเขาสามแก้ว",//Title
                "สถานที่ตั้ง หมู่ ๑ บ้านสามแก้ว ตำบลนาชะอัง อำเภอเมือง จังหวัดชุมพร",//Address
                "ชุมชนโบราณเขาสามแก้ว ตั้งอยู่ที่ตำบลนาชะอัง อำเภอเมือง จังหวัดชุมพร สันนิษฐานว่ามีอายุประมาณ ๑,๕๐๐ ปี และน่าจะเป็นเมืองร่วมสมัยกับนครศรีธรรมราช \
                ที่ตั้งขึ้นในราวศตวรรษที่ ๑๘ เมืองโบราณที่เขาสามแก้วในอดีต น่าจะมีความเจริญรุ่งเรืองมาก่อนจากหลักฐานที่ขุดพบโดยเฉพาะกลองมโหระทึก \
                ซึ่งเป็นกลองที่มีใช้เฉพาะในราชสำนักตามลัทธิพราหมณ์ แต่สาเหตุของการเป็นเมืองร้างไม่ปรากฏชัดเจน",//Information
                "มีการขุดพบกลองมโหระทึก ซึ่งมีลักษณะคล้ายคลึงกับกลองที่ขุดพบที่เกาะสมุย จังหวัดสุราษฏร์ธานี แต่มีความแตกต่างที่ลวดลายข้างกลอง ซึ่งกรมศิลปากรได้ประมาณอายุของกลองไว้ว่าประมาณ ๑,๗๐๐ - ๒,๐๐๐ ปี \
                นอกจากนี้ยังพบว่ามีลูกปัดสีประเภทต่าง ๆ เก็บซ่อนในกลองมโหระทึกอีกจำนวนหนึ่ง"//Place เป็นหลักฐานที่พบ
            )
        ],
        cardlist: [
            new Card(
                1,
                'content/noth/first.html',
                'อุทยานประวัติศาสตร์กำแพงเพชร',
                'img/อุทยานประวัติศาสตร์กำแพงเพชร1.jpg',
                'จังหวัดกำแพงเพชร',
                'brand new hotel in pattaya! i\'ve always thought the what ever photos they post in agoda doesnt really look like what theactual hotel is.but i was wrong, beside the hotel is'
            ),
            new Card(
                2,
                'content/noth/first.html',
                'เมืองโบราณเวียงกาหลง',
                'img/south.jpg',
                'จังหวัดเชียงราย',
                'brand new hotel in pattaya! i\'ve always thought the what ever photos they post in agoda doesnt really look like what theactual hotel is.but i was wrong, beside the hotel is'
            ),
            new Card(
                3,
                'content/noth/first.html',
                'เจดีย์คู่',
                'img/south.jpg',
                'จังหวัดตาก',
                'brand new hotel in pattaya! i\'ve always thought the what ever photos they post in agoda doesnt really look like what theactual hotel is.but i was wrong, beside the hotel is'
            ),
            new Card(
                4,
                '#',
                'ghj',
                'img/south.jpg',
                'จังหวัดกำแพงแสน',
                'brand new hotel in pattaya! i\'ve always thought the what ever photos they post in agoda doesnt really look like what theactual hotel is.but i was wrong, beside the hotel is'
            ),
        ]
    },
    // mounted(){
    //     if(localStorage.select)
    //     this.select = localStorage.select;
    // },
    methods:{
        eiei(id){
            app.select = id;
            console.log(app.select);
            console.log(localStorage);
        },
        checkselect: function(){
            console.log(localStorage.select);
            return app.select;
        }
    },
    mounted() {
        console.log(localStorage.select);
        if (localStorage.select) {
          this.select = localStorage.select;
        }
      },
    watch: {
        select(newName) {
          localStorage.select = newName;
        }
    },
    computed: {
        filterCard() {
            return this.cardlist.filter(card => {
                return card.title.includes(this.search) || card.location.includes(this.search);
            })
        }
    },
})